gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts200reva.h
/*
--------------------------------------------------------------------------
ADC_RX_CH - ADC RX Channel
--------------------------------------------------------------------------
*/

/* ADC RX Channel */
typedef struct ADC_RX_CH_struct
{
    register8_t CTRLA;  /* Control Register A */
    register8_t SAMPCTRL;  /* Sampling time control register */
    register8_t MUXCTRL;  /* MUX Control Register */
    register8_t INTCTRL;  /* Interrupt control register */
    register8_t reserved_1[1];
    register8_t INTSTATUS;  /* Interrupt status register */
    register8_t RESL;  /* Result register low */
    register8_t RESH;  /* Result register high */
    register8_t REFCTRL;  /* Reference control */
    register8_t EVCTRL;  /* Event Ctrl */
    register8_t reserved_2[6];
} ADC_RX_CH_t;


/*
--------------------------------------------------------------------------
BANDGAP - Bandgap
--------------------------------------------------------------------------
*/

/* Bandgap */
typedef struct BANDGAP_struct
{
    register8_t CTRL;  /* Control Register */
    register8_t CAL;  /* Calibration Register */
} BANDGAP_t;


/*
--------------------------------------------------------------------------
BIASCTRL - BIASCTRL
--------------------------------------------------------------------------
*/

/* BIASCTRL */
typedef struct BIASCTRL_struct
{
    register8_t CTRL;  /* Control Register */
    register8_t reserved_1[1];
} BIASCTRL_t;


/*
--------------------------------------------------------------------------
BOOSTIF - Boost Converter Interface
--------------------------------------------------------------------------
*/

/* Boost Converter Interface */
typedef struct BOOSTIF_struct
{
    register8_t CTRL;  /* Control Register */
    register8_t LEVEL;  /* Voltage Level */
    register8_t CNTHIGH;  /* High-period Cycle Count */
    register8_t CNTLOW;  /* Low-period Cycle Count */
    register8_t TEST;  /* Test Register */
    register8_t SETTLE;  /* Analog Settle Time */
    register8_t reserved_1[2];
} BOOSTIF_t;


/*
--------------------------------------------------------------------------
CLK - Clock System
--------------------------------------------------------------------------
*/

/* Clock System */
typedef struct CLK_struct
{
    register8_t CLKPSR;  /* Clock Prescaler Register */
    register8_t CLKSLR;  /* Prescaler Settings Lock Register */
    register8_t reserved_1[2];
    register8_t FRCCALL;  /* Fast RC Oscillator Calibration Low Byte */
    register8_t FRCCALH;  /* Fast RC Oscillator Calibration High Byte */
    register8_t ULPRCCALL;  /* Ulp RC Oscillator Calibration LSB */
    register8_t ULPRCCALH;  /* Ulp RC Oscillator Calibration MSB */
    register8_t OSCTST;  /* Oscillator Test Register */
    register8_t reserved_2[7];
} CLK_t;

/* Clock Prescaler Division Factor  */
typedef enum CLK_CLKPS_enum
{
    CLK_CLKPS_CLKPS_DIV1_gc = (0x00<<0),  /* No division */
    CLK_CLKPS_CLKPS_DIV2_gc = (0x01<<0),  /* Divide system oscillator with 2 */
    CLK_CLKPS_CLKPS_DIV4_gc = (0x02<<0),  /* Divide system oscillator with 4 */
    CLK_CLKPS_CKLPS_DIV8_gc = (0x03<<0),  /* Divide system oscillator with 8 */
} CLK_CLKPS_t;

/*
--------------------------------------------------------------------------
CPS - Capacitive Pressure Sensing Interface
--------------------------------------------------------------------------
*/

/* Capacitive Pressure Sensing Interface */
typedef struct CPS_struct
{
    register8_t CMD;  /* Command Register */
    register8_t CTRLA;  /* Control Register A */
    register8_t CTRLB;  /* Control Register B */
    register8_t CTRLC;  /* Control Register C */
    register8_t CTRLD;  /* Control Register D */
    register8_t reserved_1[2];
    register8_t STATUS;  /* Status Register */
    register8_t IDACZL;  /* Current DAC Zero Low Byte Register */
    register8_t IDACZH;  /* Current DAC Zero High Byte Register */
    register8_t IDACL;  /* Current DAC Low Byte Register */
    register8_t IDACH;  /* Current DAC High Byte Register */
    register8_t reserved_2[4];
} CPS_t;


/*
--------------------------------------------------------------------------
CPU - CPU
--------------------------------------------------------------------------
*/

/* CCP signatures */
typedef enum CCP_enum
{
    CCP_SPM_gc = (0x9D<<0),  /* SPM Instruction Protection */
    CCP_IOREG_gc = (0xD8<<0),  /* IO Register Protection */
} CCP_t;

/*
--------------------------------------------------------------------------
CRC4 - Cyclic Redundancy Checker
--------------------------------------------------------------------------
*/

/* Cyclic Redundancy Checker */
typedef struct CRC4_struct
{
    register8_t DATAIN;  /* Data Input */
    register8_t CHECKSUM;  /* Checksum */
    register8_t reserved_1[2];
} CRC4_t;


/*
--------------------------------------------------------------------------
FUSES - Fuses and Lockbits
--------------------------------------------------------------------------
*/

/* Fuses */
typedef struct NVM_FUSES_struct
{
    register8_t reserved_1[4];
    register8_t FUSEBYTE4;  /* Start-up Configuration */
    register8_t FUSEBYTE5;  /* Non-Volatile Memory Fuse Byte 5 */
    register8_t FUSEBYTE6;  /* Non-Volatile Memory Fuse Byte 6 */
    register8_t reserved_2[3];
} NVM_FUSES_t;


/* Lockbits */
typedef struct NVM_LOCKBITS_struct
{
    register8_t LOCK_BITS;  /* Lock Bits (Changed from LOCKBITS to avoid avr-libc collision) */
} NVM_LOCKBITS_t;

/* Boot Loader Section Reset Vector */
typedef enum FUSES_NVM_FUSES_BOOTRST_enum
{
    FUSES_NVM_FUSES_BOOTRST_BOOTLDR_gc = (0x00<<5),  /* Boot Loader Reset */
    FUSES_NVM_FUSES_BOOTRST_APPLICATION_gc = (0x01<<5),  /* Application Reset */
} FUSES_NVM_FUSES_BOOTRST_t;

/* Start-up Time */
typedef enum FUSES_NVM_FUSES_SUT_enum
{
    FUSES_NVM_FUSES_SUT_512MS_gc = (0x00<<2),  /* 512 ms */
    FUSES_NVM_FUSES_SUT_64MS_gc = (0x01<<2),  /* 64 ms */
    FUSES_NVM_FUSES_SUT_4MS_gc = (0x02<<2),  /* 4 ms */
    FUSES_NVM_FUSES_SUT_0MS_gc = (0x03<<2),  /* 0 ms */
} FUSES_NVM_FUSES_SUT_t;

/* Watchdog (Window) Timeout Period */
typedef enum FUSES_NVM_FUSES_WDPER_enum
{
    FUSES_NVM_FUSES_WDPER_8CLK_gc = (0x00<<0),  /* 8 cycles (8ms ) */
    FUSES_NVM_FUSES_WDPER_16CLK_gc = (0x01<<0),  /* 16 cycles (16ms ) */
    FUSES_NVM_FUSES_WDPER_32CLK_gc = (0x02<<0),  /* 32 cycles (32ms ) */
    FUSES_NVM_FUSES_WDPER_64CLK_gc = (0x03<<0),  /* 64 cycles (64ms ) */
    FUSES_NVM_FUSES_WDPER_128CLK_gc = (0x04<<0),  /* 128 cycles (0.125s ) */
    FUSES_NVM_FUSES_WDPER_256CLK_gc = (0x05<<0),  /* 256 cycles (0.25s ) */
    FUSES_NVM_FUSES_WDPER_512CLK_gc = (0x06<<0),  /* 512 cycles (0.5s ) */
    FUSES_NVM_FUSES_WDPER_1KCLK_gc = (0x07<<0),  /* 1K cycles (1s ) */
    FUSES_NVM_FUSES_WDPER_2KCLK_gc = (0x08<<0),  /* 2K cycles (2s ) */
    FUSES_NVM_FUSES_WDPER_4KCLK_gc = (0x09<<0),  /* 4K cycles (4s ) */
    FUSES_NVM_FUSES_WDPER_8KCLK_gc = (0x0A<<0),  /* 8K cycles (8s ) */
} FUSES_NVM_FUSES_WDPER_t;

/* Watchdog (Window) Timeout Period */
typedef enum FUSES_NVM_FUSES_WDWPER_enum
{
    FUSES_NVM_FUSES_WDWPER_8CLK_gc = (0x00<<4),  /* 8 cycles (8ms ) */
    FUSES_NVM_FUSES_WDWPER_16CLK_gc = (0x01<<4),  /* 16 cycles (16ms ) */
    FUSES_NVM_FUSES_WDWPER_32CLK_gc = (0x02<<4),  /* 32 cycles (32ms ) */
    FUSES_NVM_FUSES_WDWPER_64CLK_gc = (0x03<<4),  /* 64 cycles (64ms ) */
    FUSES_NVM_FUSES_WDWPER_128CLK_gc = (0x04<<4),  /* 128 cycles (0.125s ) */
    FUSES_NVM_FUSES_WDWPER_256CLK_gc = (0x05<<4),  /* 256 cycles (0.25s ) */
    FUSES_NVM_FUSES_WDWPER_512CLK_gc = (0x06<<4),  /* 512 cycles (0.5s ) */
    FUSES_NVM_FUSES_WDWPER_1KCLK_gc = (0x07<<4),  /* 1K cycles (1s ) */
    FUSES_NVM_FUSES_WDWPER_2KCLK_gc = (0x08<<4),  /* 2K cycles (2s ) */
    FUSES_NVM_FUSES_WDWPER_4KCLK_gc = (0x09<<4),  /* 4K cycles (4s ) */
    FUSES_NVM_FUSES_WDWPER_8KCLK_gc = (0x0A<<4),  /* 8K cycles (8s ) */
} FUSES_NVM_FUSES_WDWPER_t;

/* Boot lock bits - application section */
typedef enum FUSES_NVM_LOCKBITS_BLBA_enum
{
    FUSES_NVM_LOCKBITS_BLBA_RWLOCK_gc = (0x00<<4),  /* Read and write not allowed */
    FUSES_NVM_LOCKBITS_BLBA_RLOCK_gc = (0x01<<4),  /* Read not allowed */
    FUSES_NVM_LOCKBITS_BLBA_WLOCK_gc = (0x02<<4),  /* Write not allowed */
    FUSES_NVM_LOCKBITS_BLBA_NOLOCK_gc = (0x03<<4),  /* No locks */
} FUSES_NVM_LOCKBITS_BLBA_t;

/* Boot lock bits - application table section */
typedef enum FUSES_NVM_LOCKBITS_BLBAT_enum
{
    FUSES_NVM_LOCKBITS_BLBAT_RWLOCK_gc = (0x00<<2),  /* Read and write not allowed */
    FUSES_NVM_LOCKBITS_BLBAT_RLOCK_gc = (0x01<<2),  /* Read not allowed */
    FUSES_NVM_LOCKBITS_BLBAT_WLOCK_gc = (0x02<<2),  /* Write not allowed */
    FUSES_NVM_LOCKBITS_BLBAT_NOLOCK_gc = (0x03<<2),  /* No locks */
} FUSES_NVM_LOCKBITS_BLBAT_t;

/* Boot lock bits - boot setcion */
typedef enum FUSES_NVM_LOCKBITS_BLBB_enum
{
    FUSES_NVM_LOCKBITS_BLBB_RWLOCK_gc = (0x00<<6),  /* Read and write not allowed */
    FUSES_NVM_LOCKBITS_BLBB_RLOCK_gc = (0x01<<6),  /* Read not allowed */
    FUSES_NVM_LOCKBITS_BLBB_WLOCK_gc = (0x02<<6),  /* Write not allowed */
    FUSES_NVM_LOCKBITS_BLBB_NOLOCK_gc = (0x03<<6),  /* No locks */
} FUSES_NVM_LOCKBITS_BLBB_t;

/* Lock bits */
typedef enum FUSES_NVM_LOCKBITS_LB_enum
{
    FUSES_NVM_LOCKBITS_LB_RWLOCK_gc = (0x00<<0),  /* Read and write not allowed */
    FUSES_NVM_LOCKBITS_LB_WLOCK_gc = (0x02<<0),  /* Write not allowed */
    FUSES_NVM_LOCKBITS_LB_NOLOCK_gc = (0x03<<0),  /* No locks */
} FUSES_NVM_LOCKBITS_LB_t;

