gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts200reva.h
/*
--------------------------------------------------------------------------
PMIC - Programmable Multi-level Interrupt Controller
--------------------------------------------------------------------------
*/

/* Programmable Multi-level Interrupt Controller */
typedef struct PMIC_struct
{
    register8_t STATUS;  /* Status Register */
    register8_t INTPRI;  /* Interrupt Priority */
    register8_t CTRL;  /* Control Register */
    register8_t reserved_1[13];
} PMIC_t;


/*
--------------------------------------------------------------------------
PORT - I/O Port Configuration
--------------------------------------------------------------------------
*/

/* I/O Ports */
typedef struct PORT_struct
{
    register8_t DIR;  /* I/O Port Data Direction */
    register8_t reserved_1[3];
    register8_t OUT;  /* I/O Port Output */
    register8_t reserved_2[3];
    register8_t IN;  /* I/O port Input */
    register8_t INTCTRL;  /* Interrupt Control Register */
    register8_t INT0MASK;  /* Port Interrupt 0 Mask */
    register8_t INT1MASK;  /* Port Interrupt 1 Mask */
    register8_t INTFLAGS;  /* Interrupt Flag Register */
    register8_t reserved_3[3];
    register8_t PIN0CTRL;  /* Pin 0 Control Register */
    register8_t PIN1CTRL;  /* Pin 1 Control Register */
    register8_t PIN2CTRL;  /* Pin 2 Control Register */
    register8_t PIN3CTRL;  /* Pin 3 Control Register */
    register8_t PIN4CTRL;  /* Pin 4 Control Register */
    register8_t PIN5CTRL;  /* Pin 5 Control Register */
    register8_t PIN6CTRL;  /* Pin 6 Control Register */
    register8_t PIN7CTRL;  /* Pin 7 Control Register */
    register8_t reserved_4[232];
} PORT_t;

/* Port Interrupt 0 Level */
typedef enum PORT_INT0LVL_enum
{
    PORT_INT0LVL_OFF_gc = (0x00<<0),  /* Interrupt Disabled */
    PORT_INT0LVL_LO_gc = (0x01<<0),  /* Low Level */
    PORT_INT0LVL_MED_gc = (0x02<<0),  /* Medium Level */
    PORT_INT0LVL_HI_gc = (0x03<<0),  /* High Level */
} PORT_INT0LVL_t;

/* Port Interrupt 1 Level */
typedef enum PORT_INT1LVL_enum
{
    PORT_INT1LVL_OFF_gc = (0x00<<2),  /* Interrupt Disabled */
    PORT_INT1LVL_LO_gc = (0x01<<2),  /* Low Level */
    PORT_INT1LVL_MED_gc = (0x02<<2),  /* Medium Level */
    PORT_INT1LVL_HI_gc = (0x03<<2),  /* High Level */
} PORT_INT1LVL_t;

/* Input/Sense Configuration */
typedef enum PORT_ISC_enum
{
    PORT_ISC_BOTHEDGES_gc = (0x00<<0),  /* Sense Both Edges */
    PORT_ISC_RISING_gc = (0x01<<0),  /* Sense Rising Edge */
    PORT_ISC_FALLING_gc = (0x02<<0),  /* Sense Falling Edge */
    PORT_ISC_LEVEL_gc = (0x03<<0),  /* Sense Level (Transparent For Events) */
    PORT_ISC_INPUT_DISABLE_gc = (0x07<<0),  /* Disable Digital Input Buffer */
} PORT_ISC_t;

/* Output/Pull Configuration */
typedef enum PORT_OPC_enum
{
    PORT_OPC_TOTEM_gc = (0x00<<3),  /* Totempole */
    PORT_OPC_BUSKEEPER_gc = (0x01<<3),  /* Totempole w/ Bus keeper on Input and Output */
    PORT_OPC_PULLDOWN_gc = (0x02<<3),  /* Totempole w/ Pull-down on Input */
    PORT_OPC_PULLUP_gc = (0x03<<3),  /* Totempole w/ Pull-up on Input */
    PORT_OPC_WIREDOR_gc = (0x04<<3),  /* Wired OR */
    PORT_OPC_WIREDAND_gc = (0x05<<3),  /* Wired AND */
    PORT_OPC_WIREDORPULL_gc = (0x06<<3),  /* Wired OR w/ Pull-down */
    PORT_OPC_WIREDANDPULL_gc = (0x07<<3),  /* Wired AND w/ Pull-up */
} PORT_OPC_t;

/*
--------------------------------------------------------------------------
PWRCTRL - VDD2 PM Control
--------------------------------------------------------------------------
*/

/* VDD2 PM Control Interface */
typedef struct PWRCTRL_struct
{
    register8_t PWRCRVDD2;  /* VDD2 PM Power Control */
    register8_t reserved_1[3];
} PWRCTRL_t;


/*
--------------------------------------------------------------------------
RST - Reset
--------------------------------------------------------------------------
*/

/* Reset */
typedef struct RST_struct
{
    register8_t STATUS;  /* Status Register */
    register8_t CTRL;  /* Control Register */
    register8_t reserved_1[2];
} RST_t;


/*
--------------------------------------------------------------------------
SIGROW - Signature Row
--------------------------------------------------------------------------
*/

/* Production Signatures */
typedef struct NVM_PROD_SIGNATURES_struct
{
    register8_t reserved_1[8];
    register8_t LOTNUM0;  /* Lot Number Byte 0, ASCII */
    register8_t LOTNUM1;  /* Lot Number Byte 1, ASCII */
    register8_t LOTNUM2;  /* Lot Number Byte 2, ASCII */
    register8_t LOTNUM3;  /* Lot Number Byte 3, ASCII */
    register8_t LOTNUM4;  /* Lot Number Byte 4, ASCII */
    register8_t LOTNUM5;  /* Lot Number Byte 5, ASCII */
    register8_t reserved_2[2];
    register8_t WAFNUM;  /* Wafer Number */
    register8_t reserved_3[1];
    register8_t COORDX0;  /* Wafer Coordinate X Byte 0 */
    register8_t COORDX1;  /* Wafer Coordinate X Byte 1 */
    register8_t COORDY0;  /* Wafer Coordinate Y Byte 0 */
    register8_t COORDY1;  /* Wafer Coordinate Y Byte 1 */
    register8_t reserved_4[10];
    register8_t ADCCAL;  /* ADC Calibration Byte */
    register8_t TEMPSENSE25CL;  /* Internal Temperature Sensor Low Byte */
    register8_t TEMPSENSE25CH;  /* Internal Temperature Sensor High Byte */
    register8_t TEMPSENSE85CL;  /* Internal Temperature Sensor Low Byte */
    register8_t TEMPSENSE85CH;  /* Internal Temperature Sensor High Byte */
    register8_t PA1OFFSET;  /* PA1 Offset */
    register8_t PA1GAINL;  /* PA1 Gain Low Byte */
    register8_t PA1GAINH;  /* PA1 Gain High Byte */
    register8_t BATTOFFSET;  /* BATT Offset */
    register8_t BATTGAINL;  /* BATT Gain Low Byte */
    register8_t BATTGAINH;  /* BATT Gain High Byte */
    register8_t reserved_5[5];
    register8_t RXAMPOFFSET;  /* RX Amplifier Offset Byte */
    register8_t reserved_6[15];
    register8_t RCCAL24MHZL;  /* 24MHz RC Oscillator Calibration Low Byte */
    register8_t RCCAL24MHZH;  /* 24MHz RC Oscillator Calibration High Byte */
    register8_t ULPRCCALL;  /* ULP RC Oscillator Calibration Low Byte */
    register8_t ULPRCCALH;  /* ULP RC Oscillator Calibration High Byte */
    register8_t BGCAL;  /* Band Gap Calibration Byte */
    register8_t LDOCAL;  /* LDO Calibration */
    register8_t NVMPROG;  /* NVM Programming */
    register8_t NVMERASE;  /* NVM Erase */
    register8_t ADCBIAS;  /* ADC Bias Selection */
    register8_t reserved_7[21];
    register8_t AUTOLOADEN;  /* Autoload Enable */
    register8_t reserved_8[1];
    register8_t RC24MHZROOML;  /* 24 MHz Room Low Byte */
    register8_t RC24MHZROOMH;  /* 24 MHz Room High Byte */
    register8_t RC24MHZHOTL;  /* 24 MHz Hot Low Byte */
    register8_t RC24MHZHOTH;  /* 24 MHz Hot High Byte */
    register8_t ULPRCROOML;  /* ULP RC Room Low Byte */
    register8_t ULPRCROOMH;  /* ULP RC Room High Byte */
    register8_t ULPRCHOTL;  /* ULP RC Hot Low Byte */
    register8_t ULPRCHOTH;  /* ULP RC Hot High Byte */
    register8_t reserved_9[24];
} NVM_PROD_SIGNATURES_t;


