gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts200reva.h
/* Closed window period */
typedef enum WDT_WPER_enum
{
    WDT_WPER_8CLK_gc = (0x00<<2),  /* 8 cycles (8ms ) */
    WDT_WPER_16CLK_gc = (0x01<<2),  /* 16 cycles (16ms ) */
    WDT_WPER_32CLK_gc = (0x02<<2),  /* 32 cycles (32ms ) */
    WDT_WPER_64CLK_gc = (0x03<<2),  /* 64 cycles (64ms ) */
    WDT_WPER_128CLK_gc = (0x04<<2),  /* 128 cycles (0.128s) */
    WDT_WPER_256CLK_gc = (0x05<<2),  /* 256 cycles (0.26s) */
    WDT_WPER_512CLK_gc = (0x06<<2),  /* 512 cycles (0.5s) */
    WDT_WPER_1KCLK_gc = (0x07<<2),  /* 1K cycles (1s ) */
    WDT_WPER_2KCLK_gc = (0x08<<2),  /* 2K cycles (2s ) */
    WDT_WPER_4KCLK_gc = (0x09<<2),  /* 4K cycles (4s ) */
    WDT_WPER_8KCLK_gc = (0x0A<<2),  /* 8K cycles (8s ) */
} WDT_WPER_t;

/*
--------------------------------------------------------------------------
WUT - Wake-up Timer
--------------------------------------------------------------------------
*/

/* Wake-up Timer */
typedef struct WUT_struct
{
    register8_t CTRL;  /* Control Register */
    register8_t INTCTRL;  /* Interrupt Control Register */
    register8_t STATUS;  /* Status Register */
    register8_t reserved_1[1];
} WUT_t;

/* Wake-up Timer Mode */
typedef enum WUT_MODE_enum
{
    WUT_MODE_DISABLE_gc = (0x00<<3),  /* Disabled */
    WUT_MODE_DIRECT_gc = (0x01<<3),  /* Direct on Timekeeper event  */
    WUT_MODE_EVERY_8TH_gc = (0x02<<3),  /* Every 8th Timekeeper event */
} WUT_MODE_t;

/* Wake-up Timer Prescaling */
typedef enum WUT_PRESC_enum
{
    WUT_PRESC_PRESC_4096_gc = (0x00<<0),  /* 32ms with 125kHz Timekeeper clock (actual clock is chip dependent) */
    WUT_PRESC_PRESC_8192_gc = (0x01<<0),  /* 65ms with 125kHz Timerkeeper clock (actual clock is chip dependent) */
    WUT_PRESC_RPESC_16384_gc = (0x02<<0),  /* 131ms with 125kHz Timekeeper clock (actual clock is chip dependent) */
    WUT_PRESC_PRESC_32768_gc = (0x03<<0),  /* 263ms with 125kHz Timekeeper clock (actual clock is chip dependent) */
    WUT_PRESC_PRESC_65536_gc = (0x04<<0),  /* 524ms with 125kHz Timekeeper clock (actual clock is chip dependent) */
    WUT_PRESC_PRESC_131072_gc = (0x05<<0),  /* 1s with 125kHz Timekeeper clock (actual clock is chip dependent) */
    WUT_PRESC_PRESC_262144_gc = (0x06<<0),  /* 2s with 125kHz Timekeeper clock (actual clock is chip dependent) */
    WUT_PRESC_PRESC_524288_gc = (0x07<<0),  /* 4s with 125kHz Timekeeper clock (actual clock is chip dependent) */
} WUT_PRESC_t;

/*
--------------------------------------------------------------------------
XOCD - On-Chip Debug System
--------------------------------------------------------------------------
*/

/* On-Chip Debug System */
typedef struct OCD_struct
{
    register8_t OCDR0;  /* OCD Register 0 */
    register8_t OCDR1;  /* OCD Register 1 */
} OCD_t;

/*
==========================================================================
IO Module Instances. Mapped to memory.
==========================================================================
*/

#define TSTCTRL           (*(TSTCTRL_t *) 0x0000) /* Test Control */
#define VPORT0              (*(VPORT_t *) 0x0010) /* Virtual Port */
#define VPORT1              (*(VPORT_t *) 0x0014) /* Virtual Port */
#define VPORT2              (*(VPORT_t *) 0x0018) /* Virtual Port */
#define VPORT3              (*(VPORT_t *) 0x001C) /* Virtual Port */
#define OCD                   (*(OCD_t *) 0x002E) /* On-Chip Debug System */
#define SLEEP               (*(SLEEP_t *) 0x0040) /* Sleep Controller */
#define RST                   (*(RST_t *) 0x0044) /* Reset */
#define BANDGAP           (*(BANDGAP_t *) 0x0048) /* Bandgap */
#define BIASCTRL         (*(BIASCTRL_t *) 0x004A) /* BIASCTRL */
#define LDO                   (*(LDO_t *) 0x004C) /* LDO */
#define CLK                   (*(CLK_t *) 0x0050) /* Clock System */
#define WDT                   (*(WDT_t *) 0x0080) /* Watch-Dog Timer */
#define MCU                   (*(MCU_t *) 0x0090) /* MCU Control */
#define PMIC                 (*(PMIC_t *) 0x00A0) /* Programmable Multi-level Interrupt Controller */
#define WUT                   (*(WUT_t *) 0x00C0) /* Wake-up Timer */
#define CRC4                 (*(CRC4_t *) 0x00C4) /* Cyclic Redundancy Checker */
#define TSTACC             (*(TSTACC_t *) 0x00C8) /* Test Access Control */
#define NVM                   (*(NVM_t *) 0x01C0) /* Non-volatile Memory Controller */
#define BOOSTIF           (*(BOOSTIF_t *) 0x03D8) /* Boost Converter Interface */
#define PWRCTRL           (*(PWRCTRL_t *) 0x03E4) /* VDD2 PM Control Interface */
#define TWIC                  (*(TWI_t *) 0x03F0) /* Two-Wire Interface */
#define TIMER             (*(TIM8_16_t *) 0x0400) /* Timer 8/16 bit */
#define TIMPRESC         (*(TIMPRESC_t *) 0x0420) /* Timer Prescaler */
#define STYLUSCOM       (*(STYLUSCOM_t *) 0x0440) /* Stylus Communication Interface */
#define PORTA                (*(PORT_t *) 0x0480) /* I/O Ports */
#define PORTB                (*(PORT_t *) 0x04A0) /* I/O Ports */
#define PORTC                (*(PORT_t *) 0x04C0) /* I/O Ports */
#define CPS                   (*(CPS_t *) 0x0600) /* Capacitive Pressure Sensing Interface */
#define ADCCMN            (*(ADC_CMN_t *) 0x0800) /* ADC Common Settings */
#define ADCGENCH        (*(ADC_GEN_CH_t *) 0x0810) /* ADC General Channel */
#define ADCPRESCH       (*(ADC_PRES_CH_t *) 0x0820) /* ADC System */
#define ADCRXCH         (*(ADC_RX_CH_t *) 0x0830) /* ADC RX Channel */
#define SIMULATOR       (*(SIMULATOR_t *) 0x0FF0) /* Simulator  */

#endif /* !defined (__ASSEMBLER__) */


/* ========== Flattened fully qualified IO register names ========== */


/* GPIO - General Purpose IO Registers */
#define GPIO_GPIOR0  _SFR_MEM8(0x0000)
#define GPIO_GPIOR1  _SFR_MEM8(0x0001)
#define GPIO_GPIOR2  _SFR_MEM8(0x0002)
#define GPIO_GPIOR3  _SFR_MEM8(0x0003)


/* Deprecated */
#define GPIO_GPIO0  _SFR_MEM8(0x0000)
#define GPIO_GPIO1  _SFR_MEM8(0x0001)
#define GPIO_GPIO2  _SFR_MEM8(0x0002)
#define GPIO_GPIO3  _SFR_MEM8(0x0003)


/* NVM_FUSES (FUSE) - Fuses */
#define FUSE_FUSEBYTE4  _SFR_MEM8(0x0004)
#define FUSE_FUSEBYTE5  _SFR_MEM8(0x0005)
#define FUSE_FUSEBYTE6  _SFR_MEM8(0x0006)


/* NVM_LOCKBITS (LOCKBIT) - Lockbits */
#define LOCKBIT_LOCKBITS  _SFR_MEM8(0x0000)


/* NVM_PROD_SIGNATURES (PROD_SIGNATURES) - Production Signatures */
#define PRODSIGNATURES_LOTNUM0  _SFR_MEM8(0x0008)
#define PRODSIGNATURES_LOTNUM1  _SFR_MEM8(0x0009)
#define PRODSIGNATURES_LOTNUM2  _SFR_MEM8(0x000A)
#define PRODSIGNATURES_LOTNUM3  _SFR_MEM8(0x000B)
#define PRODSIGNATURES_LOTNUM4  _SFR_MEM8(0x000C)
#define PRODSIGNATURES_LOTNUM5  _SFR_MEM8(0x000D)
#define PRODSIGNATURES_WAFNUM  _SFR_MEM8(0x0010)
#define PRODSIGNATURES_COORDX0  _SFR_MEM8(0x0012)
#define PRODSIGNATURES_COORDX1  _SFR_MEM8(0x0013)
#define PRODSIGNATURES_COORDY0  _SFR_MEM8(0x0014)
#define PRODSIGNATURES_COORDY1  _SFR_MEM8(0x0015)
#define PRODSIGNATURES_ADCCAL  _SFR_MEM8(0x0020)
#define PRODSIGNATURES_TEMPSENSE25CL  _SFR_MEM8(0x0021)
#define PRODSIGNATURES_TEMPSENSE25CH  _SFR_MEM8(0x0022)
#define PRODSIGNATURES_TEMPSENSE85CL  _SFR_MEM8(0x0023)
#define PRODSIGNATURES_TEMPSENSE85CH  _SFR_MEM8(0x0024)
#define PRODSIGNATURES_PA1OFFSET  _SFR_MEM8(0x0025)
#define PRODSIGNATURES_PA1GAINL  _SFR_MEM8(0x0026)
#define PRODSIGNATURES_PA1GAINH  _SFR_MEM8(0x0027)
#define PRODSIGNATURES_BATTOFFSET  _SFR_MEM8(0x0028)
#define PRODSIGNATURES_BATTGAINL  _SFR_MEM8(0x0029)
#define PRODSIGNATURES_BATTGAINH  _SFR_MEM8(0x002A)
#define PRODSIGNATURES_RXAMPOFFSET  _SFR_MEM8(0x0030)
#define PRODSIGNATURES_RCCAL24MHZL  _SFR_MEM8(0x0040)
#define PRODSIGNATURES_RCCAL24MHZH  _SFR_MEM8(0x0041)
#define PRODSIGNATURES_ULPRCCALL  _SFR_MEM8(0x0042)
#define PRODSIGNATURES_ULPRCCALH  _SFR_MEM8(0x0043)
#define PRODSIGNATURES_BGCAL  _SFR_MEM8(0x0044)
#define PRODSIGNATURES_LDOCAL  _SFR_MEM8(0x0045)
#define PRODSIGNATURES_NVMPROG  _SFR_MEM8(0x0046)
#define PRODSIGNATURES_NVMERASE  _SFR_MEM8(0x0047)
#define PRODSIGNATURES_ADCBIAS  _SFR_MEM8(0x0048)
#define PRODSIGNATURES_AUTOLOADEN  _SFR_MEM8(0x005E)
#define PRODSIGNATURES_RC24MHZROOML  _SFR_MEM8(0x0060)
#define PRODSIGNATURES_RC24MHZROOMH  _SFR_MEM8(0x0061)
#define PRODSIGNATURES_RC24MHZHOTL  _SFR_MEM8(0x0062)
#define PRODSIGNATURES_RC24MHZHOTH  _SFR_MEM8(0x0063)
#define PRODSIGNATURES_ULPRCROOML  _SFR_MEM8(0x0064)
#define PRODSIGNATURES_ULPRCROOMH  _SFR_MEM8(0x0065)
#define PRODSIGNATURES_ULPRCHOTL  _SFR_MEM8(0x0066)
#define PRODSIGNATURES_ULPRCHOTH  _SFR_MEM8(0x0067)


/* TSTCTRL - Test Control */
#define TSTCTRL_CTRL0  _SFR_MEM8(0x0000)
#define TSTCTRL_CTRL1  _SFR_MEM8(0x0001)
#define TSTCTRL_CTRL2  _SFR_MEM8(0x0002)
#define TSTCTRL_CTRL3  _SFR_MEM8(0x0003)


/* VPORT (VPORT0) - Virtual Port */
#define VPORT0_DIR  _SFR_MEM8(0x0010)
#define VPORT0_OUT  _SFR_MEM8(0x0011)
#define VPORT0_IN  _SFR_MEM8(0x0012)
#define VPORT0_INTFLAGS  _SFR_MEM8(0x0013)


