gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts200reva.h
/* PORT (PORTC) - I/O Ports */
#define PORTC_DIR  _SFR_MEM8(0x04C0)
#define PORTC_OUT  _SFR_MEM8(0x04C4)
#define PORTC_IN  _SFR_MEM8(0x04C8)
#define PORTC_INTCTRL  _SFR_MEM8(0x04C9)
#define PORTC_INT0MASK  _SFR_MEM8(0x04CA)
#define PORTC_INT1MASK  _SFR_MEM8(0x04CB)
#define PORTC_INTFLAGS  _SFR_MEM8(0x04CC)
#define PORTC_PIN0CTRL  _SFR_MEM8(0x04D0)
#define PORTC_PIN1CTRL  _SFR_MEM8(0x04D1)
#define PORTC_PIN2CTRL  _SFR_MEM8(0x04D2)
#define PORTC_PIN3CTRL  _SFR_MEM8(0x04D3)
#define PORTC_PIN4CTRL  _SFR_MEM8(0x04D4)
#define PORTC_PIN5CTRL  _SFR_MEM8(0x04D5)
#define PORTC_PIN6CTRL  _SFR_MEM8(0x04D6)
#define PORTC_PIN7CTRL  _SFR_MEM8(0x04D7)


/* CPS - Capacitive Pressure Sensing Interface */
#define CPS_CMD  _SFR_MEM8(0x0600)
#define CPS_CTRLA  _SFR_MEM8(0x0601)
#define CPS_CTRLB  _SFR_MEM8(0x0602)
#define CPS_CTRLC  _SFR_MEM8(0x0603)
#define CPS_CTRLD  _SFR_MEM8(0x0604)
#define CPS_STATUS  _SFR_MEM8(0x0607)
#define CPS_IDACZL  _SFR_MEM8(0x0608)
#define CPS_IDACZH  _SFR_MEM8(0x0609)
#define CPS_IDACL  _SFR_MEM8(0x060A)
#define CPS_IDACH  _SFR_MEM8(0x060B)


/* ADC_CMN - ADC Common Settings */
#define ADCCMN_CTRLA  _SFR_MEM8(0x0800)
#define ADCCMN_CTRLB  _SFR_MEM8(0x0801)
#define ADCCMN_PRESCALER  _SFR_MEM8(0x0804)
#define ADCCMN_CHSTATUS  _SFR_MEM8(0x0808)
#define ADCCMN_CAL  _SFR_MEM8(0x080C)
#define ADCCMN_TEST  _SFR_MEM8(0x080F)


/* ADC_GEN_CH - ADC General Channel */
#define ADCGENCH_CTRLA  _SFR_MEM8(0x0810)
#define ADCGENCH_SAMPCTRL  _SFR_MEM8(0x0811)
#define ADCGENCH_MUXCTRL  _SFR_MEM8(0x0812)
#define ADCGENCH_INTCTRL  _SFR_MEM8(0x0813)
#define ADCGENCH_INTSTATUS  _SFR_MEM8(0x0815)
#define ADCGENCH_RESL  _SFR_MEM8(0x0816)
#define ADCGENCH_RESH  _SFR_MEM8(0x0817)
#define ADCGENCH_REFCTRL  _SFR_MEM8(0x0818)


/* ADC_PRES_CH - ADC System */
#define ADCPRESCH_CTRLA  _SFR_MEM8(0x0820)
#define ADCPRESCH_SAMPCTRL  _SFR_MEM8(0x0821)
#define ADCPRESCH_INTCTRL  _SFR_MEM8(0x0823)
#define ADCPRESCH_INTSTATUS  _SFR_MEM8(0x0825)
#define ADCPRESCH_RESL  _SFR_MEM8(0x0826)
#define ADCPRESCH_RESH  _SFR_MEM8(0x0827)
#define ADCPRESCH_REFCTRL  _SFR_MEM8(0x0828)
#define ADCPRESCH_EVCTRL  _SFR_MEM8(0x0829)


/* ADC_RX_CH - ADC RX Channel */
#define ADCRXCH_CTRLA  _SFR_MEM8(0x0830)
#define ADCRXCH_SAMPCTRL  _SFR_MEM8(0x0831)
#define ADCRXCH_MUXCTRL  _SFR_MEM8(0x0832)
#define ADCRXCH_INTCTRL  _SFR_MEM8(0x0833)
#define ADCRXCH_INTSTATUS  _SFR_MEM8(0x0835)
#define ADCRXCH_RESL  _SFR_MEM8(0x0836)
#define ADCRXCH_RESH  _SFR_MEM8(0x0837)
#define ADCRXCH_REFCTRL  _SFR_MEM8(0x0838)
#define ADCRXCH_EVCTRL  _SFR_MEM8(0x0839)


/* SIMULATOR - Simulator  */
#define SIMULATOR_SIMCTRL0  _SFR_MEM8(0x0FF0)
#define SIMULATOR_SIMCTRL1  _SFR_MEM8(0x0FF1)



/*================== Bitfield Definitions ================== */

/* ADC_CMN - ADC Common Settings */
/* ADC_CMN.CTRLA  bit masks and bit positions */
#define ADC_CMN_FLUSH_bm  0x02  /* Pipeline Flush bit mask. */
#define ADC_CMN_FLUSH_bp  1  /* Pipeline Flush bit position. */
#define ADC_CMN_REFBUFMODE_bm  0x10  /* Reference buffer mode bit mask. */
#define ADC_CMN_REFBUFMODE_bp  4  /* Reference buffer mode bit position. */

/* ADC_CMN.CTRLB  bit masks and bit positions */
#define ADC_CMN_RESOLUTION_gm  0x03  /* Conversion Result Resolution group mask. */
#define ADC_CMN_RESOLUTION_gp  0  /* Conversion Result Resolution group position. */
#define ADC_CMN_RESOLUTION0_bm  (1<<0)  /* Conversion Result Resolution bit 0 mask. */
#define ADC_CMN_RESOLUTION0_bp  0  /* Conversion Result Resolution bit 0 position. */
#define ADC_CMN_RESOLUTION1_bm  (1<<1)  /* Conversion Result Resolution bit 1 mask. */
#define ADC_CMN_RESOLUTION1_bp  1  /* Conversion Result Resolution bit 1 position. */
#define ADC_CMN_ADCINIT_gm  0x1C  /* ADC initialization clock cycles group mask. */
#define ADC_CMN_ADCINIT_gp  2  /* ADC initialization clock cycles group position. */
#define ADC_CMN_ADCINIT0_bm  (1<<2)  /* ADC initialization clock cycles bit 0 mask. */
#define ADC_CMN_ADCINIT0_bp  2  /* ADC initialization clock cycles bit 0 position. */
#define ADC_CMN_ADCINIT1_bm  (1<<3)  /* ADC initialization clock cycles bit 1 mask. */
#define ADC_CMN_ADCINIT1_bp  3  /* ADC initialization clock cycles bit 1 position. */
#define ADC_CMN_ADCINIT2_bm  (1<<4)  /* ADC initialization clock cycles bit 2 mask. */
#define ADC_CMN_ADCINIT2_bp  4  /* ADC initialization clock cycles bit 2 position. */
#define ADC_CMN_CURRLIMIT_gm  0x60  /* Current Limitation group mask. */
#define ADC_CMN_CURRLIMIT_gp  5  /* Current Limitation group position. */
#define ADC_CMN_CURRLIMIT0_bm  (1<<5)  /* Current Limitation bit 0 mask. */
#define ADC_CMN_CURRLIMIT0_bp  5  /* Current Limitation bit 0 position. */
#define ADC_CMN_CURRLIMIT1_bm  (1<<6)  /* Current Limitation bit 1 mask. */
#define ADC_CMN_CURRLIMIT1_bp  6  /* Current Limitation bit 1 position. */

/* ADC_CMN.PRESCALER  bit masks and bit positions */
#define ADC_CMN_PRESCALER_gm  0x07  /* Prescaler Configuration group mask. */
#define ADC_CMN_PRESCALER_gp  0  /* Prescaler Configuration group position. */
#define ADC_CMN_PRESCALER0_bm  (1<<0)  /* Prescaler Configuration bit 0 mask. */
#define ADC_CMN_PRESCALER0_bp  0  /* Prescaler Configuration bit 0 position. */
#define ADC_CMN_PRESCALER1_bm  (1<<1)  /* Prescaler Configuration bit 1 mask. */
#define ADC_CMN_PRESCALER1_bp  1  /* Prescaler Configuration bit 1 position. */
#define ADC_CMN_PRESCALER2_bm  (1<<2)  /* Prescaler Configuration bit 2 mask. */
#define ADC_CMN_PRESCALER2_bp  2  /* Prescaler Configuration bit 2 position. */

/* ADC_CMN.CHSTATUS  bit masks and bit positions */
#define ADC_CMN_GENCHBUSY_bm  0x01  /* General channel busy bit mask. */
#define ADC_CMN_GENCHBUSY_bp  0  /* General channel busy bit position. */
#define ADC_CMN_PRCHBUSY_bm  0x02  /* Pressure sensor channel busy bit mask. */
#define ADC_CMN_PRCHBUSY_bp  1  /* Pressure sensor channel busy bit position. */
#define ADC_CMN_RXCHBUSY_bm  0x04  /* RXBUF channel busy bit mask. */
#define ADC_CMN_RXCHBUSY_bp  2  /* RXBUF channel busy bit position. */

/* ADC_CMN.CAL  bit masks and bit positions */
#define ADC_CMN_CAL_gm  0xFF  /* ADC calibration value group mask. */
#define ADC_CMN_CAL_gp  0  /* ADC calibration value group position. */
#define ADC_CMN_CAL0_bm  (1<<0)  /* ADC calibration value bit 0 mask. */
#define ADC_CMN_CAL0_bp  0  /* ADC calibration value bit 0 position. */
#define ADC_CMN_CAL1_bm  (1<<1)  /* ADC calibration value bit 1 mask. */
#define ADC_CMN_CAL1_bp  1  /* ADC calibration value bit 1 position. */
#define ADC_CMN_CAL2_bm  (1<<2)  /* ADC calibration value bit 2 mask. */
#define ADC_CMN_CAL2_bp  2  /* ADC calibration value bit 2 position. */
#define ADC_CMN_CAL3_bm  (1<<3)  /* ADC calibration value bit 3 mask. */
#define ADC_CMN_CAL3_bp  3  /* ADC calibration value bit 3 position. */
#define ADC_CMN_CAL4_bm  (1<<4)  /* ADC calibration value bit 4 mask. */
#define ADC_CMN_CAL4_bp  4  /* ADC calibration value bit 4 position. */
#define ADC_CMN_CAL5_bm  (1<<5)  /* ADC calibration value bit 5 mask. */
#define ADC_CMN_CAL5_bp  5  /* ADC calibration value bit 5 position. */
#define ADC_CMN_CAL6_bm  (1<<6)  /* ADC calibration value bit 6 mask. */
#define ADC_CMN_CAL6_bp  6  /* ADC calibration value bit 6 position. */
#define ADC_CMN_CAL7_bm  (1<<7)  /* ADC calibration value bit 7 mask. */
#define ADC_CMN_CAL7_bp  7  /* ADC calibration value bit 7 position. */

/* ADC_CMN.TEST  bit masks and bit positions */
#define ADC_CMN_ADCCOREEN_bm  0x01  /* Enable ADC analog core bit mask. */
#define ADC_CMN_ADCCOREEN_bp  0  /* Enable ADC analog core bit position. */
#define ADC_CMN_BIASSEL_bm  0x02  /* Bias select bit mask. */
#define ADC_CMN_BIASSEL_bp  1  /* Bias select bit position. */
#define ADC_CMN_BIASCAL_gm  0x3C  /* Bias calibration group mask. */
#define ADC_CMN_BIASCAL_gp  2  /* Bias calibration group position. */
#define ADC_CMN_BIASCAL0_bm  (1<<2)  /* Bias calibration bit 0 mask. */
#define ADC_CMN_BIASCAL0_bp  2  /* Bias calibration bit 0 position. */
#define ADC_CMN_BIASCAL1_bm  (1<<3)  /* Bias calibration bit 1 mask. */
#define ADC_CMN_BIASCAL1_bp  3  /* Bias calibration bit 1 position. */
#define ADC_CMN_BIASCAL2_bm  (1<<4)  /* Bias calibration bit 2 mask. */
#define ADC_CMN_BIASCAL2_bp  4  /* Bias calibration bit 2 position. */
#define ADC_CMN_BIASCAL3_bm  (1<<5)  /* Bias calibration bit 3 mask. */
#define ADC_CMN_BIASCAL3_bp  5  /* Bias calibration bit 3 position. */
#define ADC_CMN_ADCREFBUFEN_bm  0x40  /* ADC reference buffern enable bit mask. */
#define ADC_CMN_ADCREFBUFEN_bp  6  /* ADC reference buffern enable bit position. */
#define ADC_CMN_ADCCORERESET_bm  0x80  /* Reset ADC analog core bit mask. */
#define ADC_CMN_ADCCORERESET_bp  7  /* Reset ADC analog core bit position. */

/* ADC_GEN_CH - ADC General Channel */
/* ADC_GEN_CH.CTRLA  bit masks and bit positions */
#define ADC_GEN_CH_GAIN_gm  0x0C  /* Gain Factor group mask. */
#define ADC_GEN_CH_GAIN_gp  2  /* Gain Factor group position. */
#define ADC_GEN_CH_GAIN0_bm  (1<<2)  /* Gain Factor bit 0 mask. */
#define ADC_GEN_CH_GAIN0_bp  2  /* Gain Factor bit 0 position. */
#define ADC_GEN_CH_GAIN1_bm  (1<<3)  /* Gain Factor bit 1 mask. */
#define ADC_GEN_CH_GAIN1_bp  3  /* Gain Factor bit 1 position. */
#define ADC_GEN_CH_START_bm  0x80  /* Start Conversion bit mask. */
#define ADC_GEN_CH_START_bp  7  /* Start Conversion bit position. */

/* ADC_GEN_CH.SAMPCTRL  bit masks and bit positions */
#define ADC_GEN_CH_SAMPVAL_gm  0x1F  /* Sampling Time Control group mask. */
#define ADC_GEN_CH_SAMPVAL_gp  0  /* Sampling Time Control group position. */
#define ADC_GEN_CH_SAMPVAL0_bm  (1<<0)  /* Sampling Time Control bit 0 mask. */
#define ADC_GEN_CH_SAMPVAL0_bp  0  /* Sampling Time Control bit 0 position. */
#define ADC_GEN_CH_SAMPVAL1_bm  (1<<1)  /* Sampling Time Control bit 1 mask. */
#define ADC_GEN_CH_SAMPVAL1_bp  1  /* Sampling Time Control bit 1 position. */
#define ADC_GEN_CH_SAMPVAL2_bm  (1<<2)  /* Sampling Time Control bit 2 mask. */
#define ADC_GEN_CH_SAMPVAL2_bp  2  /* Sampling Time Control bit 2 position. */
#define ADC_GEN_CH_SAMPVAL3_bm  (1<<3)  /* Sampling Time Control bit 3 mask. */
#define ADC_GEN_CH_SAMPVAL3_bp  3  /* Sampling Time Control bit 3 position. */
#define ADC_GEN_CH_SAMPVAL4_bm  (1<<4)  /* Sampling Time Control bit 4 mask. */
#define ADC_GEN_CH_SAMPVAL4_bp  4  /* Sampling Time Control bit 4 position. */

/* ADC_GEN_CH.MUXCTRL  bit masks and bit positions */
#define ADC_GEN_CH_MUXNEG_gm  0x07  /* MUX Selection on negative ADC input group mask. */
#define ADC_GEN_CH_MUXNEG_gp  0  /* MUX Selection on negative ADC input group position. */
#define ADC_GEN_CH_MUXNEG0_bm  (1<<0)  /* MUX Selection on negative ADC input bit 0 mask. */
#define ADC_GEN_CH_MUXNEG0_bp  0  /* MUX Selection on negative ADC input bit 0 position. */
#define ADC_GEN_CH_MUXNEG1_bm  (1<<1)  /* MUX Selection on negative ADC input bit 1 mask. */
#define ADC_GEN_CH_MUXNEG1_bp  1  /* MUX Selection on negative ADC input bit 1 position. */
#define ADC_GEN_CH_MUXNEG2_bm  (1<<2)  /* MUX Selection on negative ADC input bit 2 mask. */
#define ADC_GEN_CH_MUXNEG2_bp  2  /* MUX Selection on negative ADC input bit 2 position. */
#define ADC_GEN_CH_MUXPOS_gm  0x70  /* MUX Selection on positive ADC input group mask. */
#define ADC_GEN_CH_MUXPOS_gp  4  /* MUX Selection on positive ADC input group position. */
#define ADC_GEN_CH_MUXPOS0_bm  (1<<4)  /* MUX Selection on positive ADC input bit 0 mask. */
#define ADC_GEN_CH_MUXPOS0_bp  4  /* MUX Selection on positive ADC input bit 0 position. */
#define ADC_GEN_CH_MUXPOS1_bm  (1<<5)  /* MUX Selection on positive ADC input bit 1 mask. */
#define ADC_GEN_CH_MUXPOS1_bp  5  /* MUX Selection on positive ADC input bit 1 position. */
#define ADC_GEN_CH_MUXPOS2_bm  (1<<6)  /* MUX Selection on positive ADC input bit 2 mask. */
#define ADC_GEN_CH_MUXPOS2_bp  6  /* MUX Selection on positive ADC input bit 2 position. */

/* ADC_GEN_CH.INTCTRL  bit masks and bit positions */
#define ADC_GEN_CH_INTLVL_gm  0x03  /* Interrupt Level group mask. */
#define ADC_GEN_CH_INTLVL_gp  0  /* Interrupt Level group position. */
#define ADC_GEN_CH_INTLVL0_bm  (1<<0)  /* Interrupt Level bit 0 mask. */
#define ADC_GEN_CH_INTLVL0_bp  0  /* Interrupt Level bit 0 position. */
#define ADC_GEN_CH_INTLVL1_bm  (1<<1)  /* Interrupt Level bit 1 mask. */
#define ADC_GEN_CH_INTLVL1_bp  1  /* Interrupt Level bit 1 position. */

/* ADC_GEN_CH.INTSTATUS  bit masks and bit positions */
#define ADC_GEN_CH_CONVIF_bm  0x01  /* Conversion interrupt flag  bit mask. */
#define ADC_GEN_CH_CONVIF_bp  0  /* Conversion interrupt flag  bit position. */
#define ADC_GEN_CH_ABORTIF_bm  0x02  /* Abort interrupt flag  bit mask. */
#define ADC_GEN_CH_ABORTIF_bp  1  /* Abort interrupt flag  bit position. */

/* ADC_GEN_CH.RESL  bit masks and bit positions */
#define ADC_GEN_CH_RES_gm  0xFF  /* Channel result low byte group mask. */
#define ADC_GEN_CH_RES_gp  0  /* Channel result low byte group position. */
#define ADC_GEN_CH_RES0_bm  (1<<0)  /* Channel result low byte bit 0 mask. */
#define ADC_GEN_CH_RES0_bp  0  /* Channel result low byte bit 0 position. */
#define ADC_GEN_CH_RES1_bm  (1<<1)  /* Channel result low byte bit 1 mask. */
#define ADC_GEN_CH_RES1_bp  1  /* Channel result low byte bit 1 position. */
#define ADC_GEN_CH_RES2_bm  (1<<2)  /* Channel result low byte bit 2 mask. */
#define ADC_GEN_CH_RES2_bp  2  /* Channel result low byte bit 2 position. */
#define ADC_GEN_CH_RES3_bm  (1<<3)  /* Channel result low byte bit 3 mask. */
#define ADC_GEN_CH_RES3_bp  3  /* Channel result low byte bit 3 position. */
#define ADC_GEN_CH_RES4_bm  (1<<4)  /* Channel result low byte bit 4 mask. */
#define ADC_GEN_CH_RES4_bp  4  /* Channel result low byte bit 4 position. */
#define ADC_GEN_CH_RES5_bm  (1<<5)  /* Channel result low byte bit 5 mask. */
#define ADC_GEN_CH_RES5_bp  5  /* Channel result low byte bit 5 position. */
#define ADC_GEN_CH_RES6_bm  (1<<6)  /* Channel result low byte bit 6 mask. */
#define ADC_GEN_CH_RES6_bp  6  /* Channel result low byte bit 6 position. */
#define ADC_GEN_CH_RES7_bm  (1<<7)  /* Channel result low byte bit 7 mask. */
#define ADC_GEN_CH_RES7_bp  7  /* Channel result low byte bit 7 position. */

/* ADC_GEN_CH.RESH  bit masks and bit positions */
/* ADC_GEN_CH_RES  is already defined. */

/* ADC_GEN_CH.REFCTRL  bit masks and bit positions */
#define ADC_GEN_CH_TEMPREFEN_bm  0x01  /* Temperature reference enable bit mask. */
#define ADC_GEN_CH_TEMPREFEN_bp  0  /* Temperature reference enable bit position. */
#define ADC_GEN_CH_REFSEL_gm  0x70  /* Channel reference select group mask. */
#define ADC_GEN_CH_REFSEL_gp  4  /* Channel reference select group position. */
#define ADC_GEN_CH_REFSEL0_bm  (1<<4)  /* Channel reference select bit 0 mask. */
#define ADC_GEN_CH_REFSEL0_bp  4  /* Channel reference select bit 0 position. */
#define ADC_GEN_CH_REFSEL1_bm  (1<<5)  /* Channel reference select bit 1 mask. */
#define ADC_GEN_CH_REFSEL1_bp  5  /* Channel reference select bit 1 position. */
#define ADC_GEN_CH_REFSEL2_bm  (1<<6)  /* Channel reference select bit 2 mask. */
#define ADC_GEN_CH_REFSEL2_bp  6  /* Channel reference select bit 2 position. */

/* ADC_PRES_CH - ADC Pressure Channel */
/* ADC_PRES_CH.CTRLA  bit masks and bit positions */
#define ADC_PRES_CH_GAIN_gm  0x0C  /* Gain Factor group mask. */
#define ADC_PRES_CH_GAIN_gp  2  /* Gain Factor group position. */
#define ADC_PRES_CH_GAIN0_bm  (1<<2)  /* Gain Factor bit 0 mask. */
#define ADC_PRES_CH_GAIN0_bp  2  /* Gain Factor bit 0 position. */
#define ADC_PRES_CH_GAIN1_bm  (1<<3)  /* Gain Factor bit 1 mask. */
#define ADC_PRES_CH_GAIN1_bp  3  /* Gain Factor bit 1 position. */
#define ADC_PRES_CH_START_bm  0x80  /* Start Conversion bit mask. */
#define ADC_PRES_CH_START_bp  7  /* Start Conversion bit position. */

/* ADC_PRES_CH.SAMPCTRL  bit masks and bit positions */
#define ADC_PRES_CH_SAMPVAL_gm  0x1F  /* Sampling Time Control group mask. */
#define ADC_PRES_CH_SAMPVAL_gp  0  /* Sampling Time Control group position. */
#define ADC_PRES_CH_SAMPVAL0_bm  (1<<0)  /* Sampling Time Control bit 0 mask. */
#define ADC_PRES_CH_SAMPVAL0_bp  0  /* Sampling Time Control bit 0 position. */
#define ADC_PRES_CH_SAMPVAL1_bm  (1<<1)  /* Sampling Time Control bit 1 mask. */
#define ADC_PRES_CH_SAMPVAL1_bp  1  /* Sampling Time Control bit 1 position. */
#define ADC_PRES_CH_SAMPVAL2_bm  (1<<2)  /* Sampling Time Control bit 2 mask. */
#define ADC_PRES_CH_SAMPVAL2_bp  2  /* Sampling Time Control bit 2 position. */
#define ADC_PRES_CH_SAMPVAL3_bm  (1<<3)  /* Sampling Time Control bit 3 mask. */
#define ADC_PRES_CH_SAMPVAL3_bp  3  /* Sampling Time Control bit 3 position. */
#define ADC_PRES_CH_SAMPVAL4_bm  (1<<4)  /* Sampling Time Control bit 4 mask. */
#define ADC_PRES_CH_SAMPVAL4_bp  4  /* Sampling Time Control bit 4 position. */

/* ADC_PRES_CH.INTCTRL  bit masks and bit positions */
#define ADC_PRES_CH_INTLVL_gm  0x03  /* Interrupt Level group mask. */
#define ADC_PRES_CH_INTLVL_gp  0  /* Interrupt Level group position. */
#define ADC_PRES_CH_INTLVL0_bm  (1<<0)  /* Interrupt Level bit 0 mask. */
#define ADC_PRES_CH_INTLVL0_bp  0  /* Interrupt Level bit 0 position. */
#define ADC_PRES_CH_INTLVL1_bm  (1<<1)  /* Interrupt Level bit 1 mask. */
#define ADC_PRES_CH_INTLVL1_bp  1  /* Interrupt Level bit 1 position. */

