gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts200reva.h
/* ADC_PRES_CH.INTSTATUS  bit masks and bit positions */
#define ADC_PRES_CH_CONVIF_bm  0x01  /* Conversion interrupt flag  bit mask. */
#define ADC_PRES_CH_CONVIF_bp  0  /* Conversion interrupt flag  bit position. */
#define ADC_PRES_CH_ABORTIF_bm  0x02  /* Abort interrupt flag  bit mask. */
#define ADC_PRES_CH_ABORTIF_bp  1  /* Abort interrupt flag  bit position. */

/* ADC_PRES_CH.RESL  bit masks and bit positions */
#define ADC_PRES_CH_RES_gm  0xFF  /* Channel result low byte group mask. */
#define ADC_PRES_CH_RES_gp  0  /* Channel result low byte group position. */
#define ADC_PRES_CH_RES0_bm  (1<<0)  /* Channel result low byte bit 0 mask. */
#define ADC_PRES_CH_RES0_bp  0  /* Channel result low byte bit 0 position. */
#define ADC_PRES_CH_RES1_bm  (1<<1)  /* Channel result low byte bit 1 mask. */
#define ADC_PRES_CH_RES1_bp  1  /* Channel result low byte bit 1 position. */
#define ADC_PRES_CH_RES2_bm  (1<<2)  /* Channel result low byte bit 2 mask. */
#define ADC_PRES_CH_RES2_bp  2  /* Channel result low byte bit 2 position. */
#define ADC_PRES_CH_RES3_bm  (1<<3)  /* Channel result low byte bit 3 mask. */
#define ADC_PRES_CH_RES3_bp  3  /* Channel result low byte bit 3 position. */
#define ADC_PRES_CH_RES4_bm  (1<<4)  /* Channel result low byte bit 4 mask. */
#define ADC_PRES_CH_RES4_bp  4  /* Channel result low byte bit 4 position. */
#define ADC_PRES_CH_RES5_bm  (1<<5)  /* Channel result low byte bit 5 mask. */
#define ADC_PRES_CH_RES5_bp  5  /* Channel result low byte bit 5 position. */
#define ADC_PRES_CH_RES6_bm  (1<<6)  /* Channel result low byte bit 6 mask. */
#define ADC_PRES_CH_RES6_bp  6  /* Channel result low byte bit 6 position. */
#define ADC_PRES_CH_RES7_bm  (1<<7)  /* Channel result low byte bit 7 mask. */
#define ADC_PRES_CH_RES7_bp  7  /* Channel result low byte bit 7 position. */

/* ADC_PRES_CH.RESH  bit masks and bit positions */
/* ADC_PRES_CH_RES  is already defined. */

/* ADC_PRES_CH.REFCTRL  bit masks and bit positions */
#define ADC_PRES_CH_REFSEL_gm  0x70  /* Channel reference select group mask. */
#define ADC_PRES_CH_REFSEL_gp  4  /* Channel reference select group position. */
#define ADC_PRES_CH_REFSEL0_bm  (1<<4)  /* Channel reference select bit 0 mask. */
#define ADC_PRES_CH_REFSEL0_bp  4  /* Channel reference select bit 0 position. */
#define ADC_PRES_CH_REFSEL1_bm  (1<<5)  /* Channel reference select bit 1 mask. */
#define ADC_PRES_CH_REFSEL1_bp  5  /* Channel reference select bit 1 position. */
#define ADC_PRES_CH_REFSEL2_bm  (1<<6)  /* Channel reference select bit 2 mask. */
#define ADC_PRES_CH_REFSEL2_bp  6  /* Channel reference select bit 2 position. */

/* ADC_PRES_CH.EVCTRL  bit masks and bit positions */
#define ADC_PRES_CH_EVEN_bm  0x01  /* Event enable bit mask. */
#define ADC_PRES_CH_EVEN_bp  0  /* Event enable bit position. */
#define ADC_PRES_CH_EVSEL_gm  0x06  /* Select event source group mask. */
#define ADC_PRES_CH_EVSEL_gp  1  /* Select event source group position. */
#define ADC_PRES_CH_EVSEL0_bm  (1<<1)  /* Select event source bit 0 mask. */
#define ADC_PRES_CH_EVSEL0_bp  1  /* Select event source bit 0 position. */
#define ADC_PRES_CH_EVSEL1_bm  (1<<2)  /* Select event source bit 1 mask. */
#define ADC_PRES_CH_EVSEL1_bp  2  /* Select event source bit 1 position. */

/* ADC_RX_CH - ADC RX Channel */
/* ADC_RX_CH.CTRLA  bit masks and bit positions */
#define ADC_RX_CH_GAIN_bm  0x04  /* Gain Factor bit mask. */
#define ADC_RX_CH_GAIN_bp  2  /* Gain Factor bit position. */
#define ADC_RX_CH_START_bm  0x80  /* Start Conversion bit mask. */
#define ADC_RX_CH_START_bp  7  /* Start Conversion bit position. */

/* ADC_RX_CH.SAMPCTRL  bit masks and bit positions */
#define ADC_RX_CH_SAMPVAL_gm  0x03  /* Sampling Time Control group mask. */
#define ADC_RX_CH_SAMPVAL_gp  0  /* Sampling Time Control group position. */
#define ADC_RX_CH_SAMPVAL0_bm  (1<<0)  /* Sampling Time Control bit 0 mask. */
#define ADC_RX_CH_SAMPVAL0_bp  0  /* Sampling Time Control bit 0 position. */
#define ADC_RX_CH_SAMPVAL1_bm  (1<<1)  /* Sampling Time Control bit 1 mask. */
#define ADC_RX_CH_SAMPVAL1_bp  1  /* Sampling Time Control bit 1 position. */

/* ADC_RX_CH.MUXCTRL  bit masks and bit positions */
#define ADC_RX_CH_MUXNEG_bm  0x01  /* MUX Selection on negative ADC input bit mask. */
#define ADC_RX_CH_MUXNEG_bp  0  /* MUX Selection on negative ADC input bit position. */
#define ADC_RX_CH_MUXPOS_bm  0x10  /* MUX Selection on positive ADC input bit mask. */
#define ADC_RX_CH_MUXPOS_bp  4  /* MUX Selection on positive ADC input bit position. */

/* ADC_RX_CH.INTCTRL  bit masks and bit positions */
#define ADC_RX_CH_INTLVL_gm  0x03  /* Interrupt Level group mask. */
#define ADC_RX_CH_INTLVL_gp  0  /* Interrupt Level group position. */
#define ADC_RX_CH_INTLVL0_bm  (1<<0)  /* Interrupt Level bit 0 mask. */
#define ADC_RX_CH_INTLVL0_bp  0  /* Interrupt Level bit 0 position. */
#define ADC_RX_CH_INTLVL1_bm  (1<<1)  /* Interrupt Level bit 1 mask. */
#define ADC_RX_CH_INTLVL1_bp  1  /* Interrupt Level bit 1 position. */

/* ADC_RX_CH.INTSTATUS  bit masks and bit positions */
#define ADC_RX_CH_CONVIF_bm  0x01  /* Conversion interrupt flag  bit mask. */
#define ADC_RX_CH_CONVIF_bp  0  /* Conversion interrupt flag  bit position. */
#define ADC_RX_CH_ABORTIF_bm  0x02  /* Abort interrupt flag  bit mask. */
#define ADC_RX_CH_ABORTIF_bp  1  /* Abort interrupt flag  bit position. */

/* ADC_RX_CH.RESL  bit masks and bit positions */
#define ADC_RX_CH_RES_gm  0xFF  /* Channel result low byte group mask. */
#define ADC_RX_CH_RES_gp  0  /* Channel result low byte group position. */
#define ADC_RX_CH_RES0_bm  (1<<0)  /* Channel result low byte bit 0 mask. */
#define ADC_RX_CH_RES0_bp  0  /* Channel result low byte bit 0 position. */
#define ADC_RX_CH_RES1_bm  (1<<1)  /* Channel result low byte bit 1 mask. */
#define ADC_RX_CH_RES1_bp  1  /* Channel result low byte bit 1 position. */
#define ADC_RX_CH_RES2_bm  (1<<2)  /* Channel result low byte bit 2 mask. */
#define ADC_RX_CH_RES2_bp  2  /* Channel result low byte bit 2 position. */
#define ADC_RX_CH_RES3_bm  (1<<3)  /* Channel result low byte bit 3 mask. */
#define ADC_RX_CH_RES3_bp  3  /* Channel result low byte bit 3 position. */
#define ADC_RX_CH_RES4_bm  (1<<4)  /* Channel result low byte bit 4 mask. */
#define ADC_RX_CH_RES4_bp  4  /* Channel result low byte bit 4 position. */
#define ADC_RX_CH_RES5_bm  (1<<5)  /* Channel result low byte bit 5 mask. */
#define ADC_RX_CH_RES5_bp  5  /* Channel result low byte bit 5 position. */
#define ADC_RX_CH_RES6_bm  (1<<6)  /* Channel result low byte bit 6 mask. */
#define ADC_RX_CH_RES6_bp  6  /* Channel result low byte bit 6 position. */
#define ADC_RX_CH_RES7_bm  (1<<7)  /* Channel result low byte bit 7 mask. */
#define ADC_RX_CH_RES7_bp  7  /* Channel result low byte bit 7 position. */

/* ADC_RX_CH.RESH  bit masks and bit positions */
/* ADC_RX_CH_RES  is already defined. */

/* ADC_RX_CH.REFCTRL  bit masks and bit positions */
#define ADC_RX_CH_REFSEL_gm  0x70  /* Channel reference select group mask. */
#define ADC_RX_CH_REFSEL_gp  4  /* Channel reference select group position. */
#define ADC_RX_CH_REFSEL0_bm  (1<<4)  /* Channel reference select bit 0 mask. */
#define ADC_RX_CH_REFSEL0_bp  4  /* Channel reference select bit 0 position. */
#define ADC_RX_CH_REFSEL1_bm  (1<<5)  /* Channel reference select bit 1 mask. */
#define ADC_RX_CH_REFSEL1_bp  5  /* Channel reference select bit 1 position. */
#define ADC_RX_CH_REFSEL2_bm  (1<<6)  /* Channel reference select bit 2 mask. */
#define ADC_RX_CH_REFSEL2_bp  6  /* Channel reference select bit 2 position. */

/* ADC_RX_CH.EVCTRL  bit masks and bit positions */
#define ADC_RX_CH_EVEN_bm  0x01  /* Event select bit mask. */
#define ADC_RX_CH_EVEN_bp  0  /* Event select bit position. */

/* BANDGAP - Bandgap */
/* BANDGAP.CTRL  bit masks and bit positions */
#define BANDGAP_SAMPTIMOFF_gm  0x07  /* Sample mode off timing group mask. */
#define BANDGAP_SAMPTIMOFF_gp  0  /* Sample mode off timing group position. */
#define BANDGAP_SAMPTIMOFF0_bm  (1<<0)  /* Sample mode off timing bit 0 mask. */
#define BANDGAP_SAMPTIMOFF0_bp  0  /* Sample mode off timing bit 0 position. */
#define BANDGAP_SAMPTIMOFF1_bm  (1<<1)  /* Sample mode off timing bit 1 mask. */
#define BANDGAP_SAMPTIMOFF1_bp  1  /* Sample mode off timing bit 1 position. */
#define BANDGAP_SAMPTIMOFF2_bm  (1<<2)  /* Sample mode off timing bit 2 mask. */
#define BANDGAP_SAMPTIMOFF2_bp  2  /* Sample mode off timing bit 2 position. */
#define BANDGAP_SBSY_bm  0x08  /* Synchronization busy bit mask. */
#define BANDGAP_SBSY_bp  3  /* Synchronization busy bit position. */
#define BANDGAP_SAMPTIMON_gm  0xF0  /* Sample mode on timing group mask. */
#define BANDGAP_SAMPTIMON_gp  4  /* Sample mode on timing group position. */
#define BANDGAP_SAMPTIMON0_bm  (1<<4)  /* Sample mode on timing bit 0 mask. */
#define BANDGAP_SAMPTIMON0_bp  4  /* Sample mode on timing bit 0 position. */
#define BANDGAP_SAMPTIMON1_bm  (1<<5)  /* Sample mode on timing bit 1 mask. */
#define BANDGAP_SAMPTIMON1_bp  5  /* Sample mode on timing bit 1 position. */
#define BANDGAP_SAMPTIMON2_bm  (1<<6)  /* Sample mode on timing bit 2 mask. */
#define BANDGAP_SAMPTIMON2_bp  6  /* Sample mode on timing bit 2 position. */
#define BANDGAP_SAMPTIMON3_bm  (1<<7)  /* Sample mode on timing bit 3 mask. */
#define BANDGAP_SAMPTIMON3_bp  7  /* Sample mode on timing bit 3 position. */

