gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts200reva.h
/* BANDGAP.CAL  bit masks and bit positions */
#define BANDGAP_CALIB_gm  0x7F  /* Calibration word group mask. */
#define BANDGAP_CALIB_gp  0  /* Calibration word group position. */
#define BANDGAP_CALIB0_bm  (1<<0)  /* Calibration word bit 0 mask. */
#define BANDGAP_CALIB0_bp  0  /* Calibration word bit 0 position. */
#define BANDGAP_CALIB1_bm  (1<<1)  /* Calibration word bit 1 mask. */
#define BANDGAP_CALIB1_bp  1  /* Calibration word bit 1 position. */
#define BANDGAP_CALIB2_bm  (1<<2)  /* Calibration word bit 2 mask. */
#define BANDGAP_CALIB2_bp  2  /* Calibration word bit 2 position. */
#define BANDGAP_CALIB3_bm  (1<<3)  /* Calibration word bit 3 mask. */
#define BANDGAP_CALIB3_bp  3  /* Calibration word bit 3 position. */
#define BANDGAP_CALIB4_bm  (1<<4)  /* Calibration word bit 4 mask. */
#define BANDGAP_CALIB4_bp  4  /* Calibration word bit 4 position. */
#define BANDGAP_CALIB5_bm  (1<<5)  /* Calibration word bit 5 mask. */
#define BANDGAP_CALIB5_bp  5  /* Calibration word bit 5 position. */
#define BANDGAP_CALIB6_bm  (1<<6)  /* Calibration word bit 6 mask. */
#define BANDGAP_CALIB6_bp  6  /* Calibration word bit 6 position. */

/* BIASCTRL - BIASCTRL */
/* BIASCTRL.CTRL  bit masks and bit positions */
#define BIASCTRL_BIAS1uA_bm  0x01  /* BIAS 1uA Auto bit mask. */
#define BIASCTRL_BIAS1uA_bp  0  /* BIAS 1uA Auto bit position. */

/* BOOSTIF - Boost Converter Interface */
/* BOOSTIF.CTRL  bit masks and bit positions */
#define BOOSTIF_EN_bm  0x01  /* Boost Converter Enable bit mask. */
#define BOOSTIF_EN_bp  0  /* Boost Converter Enable bit position. */
#define BOOSTIF_REFRESH_gm  0x0E  /* Refresh Interval group mask. */
#define BOOSTIF_REFRESH_gp  1  /* Refresh Interval group position. */
#define BOOSTIF_REFRESH0_bm  (1<<1)  /* Refresh Interval bit 0 mask. */
#define BOOSTIF_REFRESH0_bp  1  /* Refresh Interval bit 0 position. */
#define BOOSTIF_REFRESH1_bm  (1<<2)  /* Refresh Interval bit 1 mask. */
#define BOOSTIF_REFRESH1_bp  2  /* Refresh Interval bit 1 position. */
#define BOOSTIF_REFRESH2_bm  (1<<3)  /* Refresh Interval bit 2 mask. */
#define BOOSTIF_REFRESH2_bp  3  /* Refresh Interval bit 2 position. */
#define BOOSTIF_SLOWSTART_bm  0x10  /* Enable Slowstart Mode bit mask. */
#define BOOSTIF_SLOWSTART_bp  4  /* Enable Slowstart Mode bit position. */
#define BOOSTIF_OUTDIS_bm  0x20  /* Output Disable bit mask. */
#define BOOSTIF_OUTDIS_bp  5  /* Output Disable bit position. */
#define BOOSTIF_WAITFINISH_bm  0x40  /* Wait Finish Enable bit mask. */
#define BOOSTIF_WAITFINISH_bp  6  /* Wait Finish Enable bit position. */

/* BOOSTIF.LEVEL  bit masks and bit positions */
#define BOOSTIF_LEVEL_gm  0x1F  /* Boost Converter Voltage Level group mask. */
#define BOOSTIF_LEVEL_gp  0  /* Boost Converter Voltage Level group position. */
#define BOOSTIF_LEVEL0_bm  (1<<0)  /* Boost Converter Voltage Level bit 0 mask. */
#define BOOSTIF_LEVEL0_bp  0  /* Boost Converter Voltage Level bit 0 position. */
#define BOOSTIF_LEVEL1_bm  (1<<1)  /* Boost Converter Voltage Level bit 1 mask. */
#define BOOSTIF_LEVEL1_bp  1  /* Boost Converter Voltage Level bit 1 position. */
#define BOOSTIF_LEVEL2_bm  (1<<2)  /* Boost Converter Voltage Level bit 2 mask. */
#define BOOSTIF_LEVEL2_bp  2  /* Boost Converter Voltage Level bit 2 position. */
#define BOOSTIF_LEVEL3_bm  (1<<3)  /* Boost Converter Voltage Level bit 3 mask. */
#define BOOSTIF_LEVEL3_bp  3  /* Boost Converter Voltage Level bit 3 position. */
#define BOOSTIF_LEVEL4_bm  (1<<4)  /* Boost Converter Voltage Level bit 4 mask. */
#define BOOSTIF_LEVEL4_bp  4  /* Boost Converter Voltage Level bit 4 position. */

/* BOOSTIF.CNTHIGH  bit masks and bit positions */
#define BOOSTIF_CNTHIGH_gm  0x7F  /* High-period Cycle Count group mask. */
#define BOOSTIF_CNTHIGH_gp  0  /* High-period Cycle Count group position. */
#define BOOSTIF_CNTHIGH0_bm  (1<<0)  /* High-period Cycle Count bit 0 mask. */
#define BOOSTIF_CNTHIGH0_bp  0  /* High-period Cycle Count bit 0 position. */
#define BOOSTIF_CNTHIGH1_bm  (1<<1)  /* High-period Cycle Count bit 1 mask. */
#define BOOSTIF_CNTHIGH1_bp  1  /* High-period Cycle Count bit 1 position. */
#define BOOSTIF_CNTHIGH2_bm  (1<<2)  /* High-period Cycle Count bit 2 mask. */
#define BOOSTIF_CNTHIGH2_bp  2  /* High-period Cycle Count bit 2 position. */
#define BOOSTIF_CNTHIGH3_bm  (1<<3)  /* High-period Cycle Count bit 3 mask. */
#define BOOSTIF_CNTHIGH3_bp  3  /* High-period Cycle Count bit 3 position. */
#define BOOSTIF_CNTHIGH4_bm  (1<<4)  /* High-period Cycle Count bit 4 mask. */
#define BOOSTIF_CNTHIGH4_bp  4  /* High-period Cycle Count bit 4 position. */
#define BOOSTIF_CNTHIGH5_bm  (1<<5)  /* High-period Cycle Count bit 5 mask. */
#define BOOSTIF_CNTHIGH5_bp  5  /* High-period Cycle Count bit 5 position. */
#define BOOSTIF_CNTHIGH6_bm  (1<<6)  /* High-period Cycle Count bit 6 mask. */
#define BOOSTIF_CNTHIGH6_bp  6  /* High-period Cycle Count bit 6 position. */

/* BOOSTIF.CNTLOW  bit masks and bit positions */
#define BOOSTIF_CNTLOW_gm  0x7F  /* Low-period Cycle Count group mask. */
#define BOOSTIF_CNTLOW_gp  0  /* Low-period Cycle Count group position. */
#define BOOSTIF_CNTLOW0_bm  (1<<0)  /* Low-period Cycle Count bit 0 mask. */
#define BOOSTIF_CNTLOW0_bp  0  /* Low-period Cycle Count bit 0 position. */
#define BOOSTIF_CNTLOW1_bm  (1<<1)  /* Low-period Cycle Count bit 1 mask. */
#define BOOSTIF_CNTLOW1_bp  1  /* Low-period Cycle Count bit 1 position. */
#define BOOSTIF_CNTLOW2_bm  (1<<2)  /* Low-period Cycle Count bit 2 mask. */
#define BOOSTIF_CNTLOW2_bp  2  /* Low-period Cycle Count bit 2 position. */
#define BOOSTIF_CNTLOW3_bm  (1<<3)  /* Low-period Cycle Count bit 3 mask. */
#define BOOSTIF_CNTLOW3_bp  3  /* Low-period Cycle Count bit 3 position. */
#define BOOSTIF_CNTLOW4_bm  (1<<4)  /* Low-period Cycle Count bit 4 mask. */
#define BOOSTIF_CNTLOW4_bp  4  /* Low-period Cycle Count bit 4 position. */
#define BOOSTIF_CNTLOW5_bm  (1<<5)  /* Low-period Cycle Count bit 5 mask. */
#define BOOSTIF_CNTLOW5_bp  5  /* Low-period Cycle Count bit 5 position. */
#define BOOSTIF_CNTLOW6_bm  (1<<6)  /* Low-period Cycle Count bit 6 mask. */
#define BOOSTIF_CNTLOW6_bp  6  /* Low-period Cycle Count bit 6 position. */

/* BOOSTIF.TEST  bit masks and bit positions */
#define BOOSTIF_RAW_bm  0x01  /* NFET switch use analog output bit mask. */
#define BOOSTIF_RAW_bp  0  /* NFET switch use analog output bit position. */
#define BOOSTIF_ABOVE_bm  0x02  /* Regulated voltage level above configured level bit mask. */
#define BOOSTIF_ABOVE_bp  1  /* Regulated voltage level above configured level bit position. */
#define BOOSTIF_PINOD_bm  0x04  /* Pin Override Disable bit mask. */
#define BOOSTIF_PINOD_bp  2  /* Pin Override Disable bit position. */

/* BOOSTIF.SETTLE  bit masks and bit positions */
#define BOOSTIF_SETTLE_gm  0x0F  /* Analog Settle Time group mask. */
#define BOOSTIF_SETTLE_gp  0  /* Analog Settle Time group position. */
#define BOOSTIF_SETTLE0_bm  (1<<0)  /* Analog Settle Time bit 0 mask. */
#define BOOSTIF_SETTLE0_bp  0  /* Analog Settle Time bit 0 position. */
#define BOOSTIF_SETTLE1_bm  (1<<1)  /* Analog Settle Time bit 1 mask. */
#define BOOSTIF_SETTLE1_bp  1  /* Analog Settle Time bit 1 position. */
#define BOOSTIF_SETTLE2_bm  (1<<2)  /* Analog Settle Time bit 2 mask. */
#define BOOSTIF_SETTLE2_bp  2  /* Analog Settle Time bit 2 position. */
#define BOOSTIF_SETTLE3_bm  (1<<3)  /* Analog Settle Time bit 3 mask. */
#define BOOSTIF_SETTLE3_bp  3  /* Analog Settle Time bit 3 position. */

/* CLK - Clock System */
/* CLK.CLKPSR  bit masks and bit positions */
#define CLK_CLKPS_gm  0x03  /* Clock Prescale Divide Factor group mask. */
#define CLK_CLKPS_gp  0  /* Clock Prescale Divide Factor group position. */
#define CLK_CLKPS0_bm  (1<<0)  /* Clock Prescale Divide Factor bit 0 mask. */
#define CLK_CLKPS0_bp  0  /* Clock Prescale Divide Factor bit 0 position. */
#define CLK_CLKPS1_bm  (1<<1)  /* Clock Prescale Divide Factor bit 1 mask. */
#define CLK_CLKPS1_bp  1  /* Clock Prescale Divide Factor bit 1 position. */

/* CLK.CLKSLR  bit masks and bit positions */
#define CLK_CLKSL_bm  0x01  /* Clock Settings Lock bit mask. */
#define CLK_CLKSL_bp  0  /* Clock Settings Lock bit position. */

/* CLK.FRCCALL  bit masks and bit positions */
#define CLK_CAL_gm  0xFF  /* Fast RC Calibration group mask. */
#define CLK_CAL_gp  0  /* Fast RC Calibration group position. */
#define CLK_CAL0_bm  (1<<0)  /* Fast RC Calibration bit 0 mask. */
#define CLK_CAL0_bp  0  /* Fast RC Calibration bit 0 position. */
#define CLK_CAL1_bm  (1<<1)  /* Fast RC Calibration bit 1 mask. */
#define CLK_CAL1_bp  1  /* Fast RC Calibration bit 1 position. */
#define CLK_CAL2_bm  (1<<2)  /* Fast RC Calibration bit 2 mask. */
#define CLK_CAL2_bp  2  /* Fast RC Calibration bit 2 position. */
#define CLK_CAL3_bm  (1<<3)  /* Fast RC Calibration bit 3 mask. */
#define CLK_CAL3_bp  3  /* Fast RC Calibration bit 3 position. */
#define CLK_CAL4_bm  (1<<4)  /* Fast RC Calibration bit 4 mask. */
#define CLK_CAL4_bp  4  /* Fast RC Calibration bit 4 position. */
#define CLK_CAL5_bm  (1<<5)  /* Fast RC Calibration bit 5 mask. */
#define CLK_CAL5_bp  5  /* Fast RC Calibration bit 5 position. */
#define CLK_CAL6_bm  (1<<6)  /* Fast RC Calibration bit 6 mask. */
#define CLK_CAL6_bp  6  /* Fast RC Calibration bit 6 position. */
#define CLK_CAL7_bm  (1<<7)  /* Fast RC Calibration bit 7 mask. */
#define CLK_CAL7_bp  7  /* Fast RC Calibration bit 7 position. */

/* CLK.FRCCALH  bit masks and bit positions */
/* CLK_CAL  is already defined. */

