gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts200reva.h
/* NVM_PROD_SIGNATURES.LOTNUM2  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_LOTNUM2_gm  0xFF  /* Lot Number Byte 2, ASCII group mask. */
#define NVM_PROD_SIGNATURES_LOTNUM2_gp  0  /* Lot Number Byte 2, ASCII group position. */
#define NVM_PROD_SIGNATURES_LOTNUM20_bm  (1<<0)  /* Lot Number Byte 2, ASCII bit 0 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM20_bp  0  /* Lot Number Byte 2, ASCII bit 0 position. */
#define NVM_PROD_SIGNATURES_LOTNUM21_bm  (1<<1)  /* Lot Number Byte 2, ASCII bit 1 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM21_bp  1  /* Lot Number Byte 2, ASCII bit 1 position. */
#define NVM_PROD_SIGNATURES_LOTNUM22_bm  (1<<2)  /* Lot Number Byte 2, ASCII bit 2 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM22_bp  2  /* Lot Number Byte 2, ASCII bit 2 position. */
#define NVM_PROD_SIGNATURES_LOTNUM23_bm  (1<<3)  /* Lot Number Byte 2, ASCII bit 3 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM23_bp  3  /* Lot Number Byte 2, ASCII bit 3 position. */
#define NVM_PROD_SIGNATURES_LOTNUM24_bm  (1<<4)  /* Lot Number Byte 2, ASCII bit 4 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM24_bp  4  /* Lot Number Byte 2, ASCII bit 4 position. */
#define NVM_PROD_SIGNATURES_LOTNUM25_bm  (1<<5)  /* Lot Number Byte 2, ASCII bit 5 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM25_bp  5  /* Lot Number Byte 2, ASCII bit 5 position. */
#define NVM_PROD_SIGNATURES_LOTNUM26_bm  (1<<6)  /* Lot Number Byte 2, ASCII bit 6 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM26_bp  6  /* Lot Number Byte 2, ASCII bit 6 position. */
#define NVM_PROD_SIGNATURES_LOTNUM27_bm  (1<<7)  /* Lot Number Byte 2, ASCII bit 7 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM27_bp  7  /* Lot Number Byte 2, ASCII bit 7 position. */

/* NVM_PROD_SIGNATURES.LOTNUM3  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_LOTNUM3_gm  0xFF  /* Lot Number Byte 3, ASCII group mask. */
#define NVM_PROD_SIGNATURES_LOTNUM3_gp  0  /* Lot Number Byte 3, ASCII group position. */
#define NVM_PROD_SIGNATURES_LOTNUM30_bm  (1<<0)  /* Lot Number Byte 3, ASCII bit 0 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM30_bp  0  /* Lot Number Byte 3, ASCII bit 0 position. */
#define NVM_PROD_SIGNATURES_LOTNUM31_bm  (1<<1)  /* Lot Number Byte 3, ASCII bit 1 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM31_bp  1  /* Lot Number Byte 3, ASCII bit 1 position. */
#define NVM_PROD_SIGNATURES_LOTNUM32_bm  (1<<2)  /* Lot Number Byte 3, ASCII bit 2 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM32_bp  2  /* Lot Number Byte 3, ASCII bit 2 position. */
#define NVM_PROD_SIGNATURES_LOTNUM33_bm  (1<<3)  /* Lot Number Byte 3, ASCII bit 3 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM33_bp  3  /* Lot Number Byte 3, ASCII bit 3 position. */
#define NVM_PROD_SIGNATURES_LOTNUM34_bm  (1<<4)  /* Lot Number Byte 3, ASCII bit 4 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM34_bp  4  /* Lot Number Byte 3, ASCII bit 4 position. */
#define NVM_PROD_SIGNATURES_LOTNUM35_bm  (1<<5)  /* Lot Number Byte 3, ASCII bit 5 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM35_bp  5  /* Lot Number Byte 3, ASCII bit 5 position. */
#define NVM_PROD_SIGNATURES_LOTNUM36_bm  (1<<6)  /* Lot Number Byte 3, ASCII bit 6 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM36_bp  6  /* Lot Number Byte 3, ASCII bit 6 position. */
#define NVM_PROD_SIGNATURES_LOTNUM37_bm  (1<<7)  /* Lot Number Byte 3, ASCII bit 7 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM37_bp  7  /* Lot Number Byte 3, ASCII bit 7 position. */

/* NVM_PROD_SIGNATURES.LOTNUM4  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_LOTNUM4_gm  0xFF  /* Lot Number Byte 4, ASCII group mask. */
#define NVM_PROD_SIGNATURES_LOTNUM4_gp  0  /* Lot Number Byte 4, ASCII group position. */
#define NVM_PROD_SIGNATURES_LOTNUM40_bm  (1<<0)  /* Lot Number Byte 4, ASCII bit 0 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM40_bp  0  /* Lot Number Byte 4, ASCII bit 0 position. */
#define NVM_PROD_SIGNATURES_LOTNUM41_bm  (1<<1)  /* Lot Number Byte 4, ASCII bit 1 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM41_bp  1  /* Lot Number Byte 4, ASCII bit 1 position. */
#define NVM_PROD_SIGNATURES_LOTNUM42_bm  (1<<2)  /* Lot Number Byte 4, ASCII bit 2 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM42_bp  2  /* Lot Number Byte 4, ASCII bit 2 position. */
#define NVM_PROD_SIGNATURES_LOTNUM43_bm  (1<<3)  /* Lot Number Byte 4, ASCII bit 3 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM43_bp  3  /* Lot Number Byte 4, ASCII bit 3 position. */
#define NVM_PROD_SIGNATURES_LOTNUM44_bm  (1<<4)  /* Lot Number Byte 4, ASCII bit 4 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM44_bp  4  /* Lot Number Byte 4, ASCII bit 4 position. */
#define NVM_PROD_SIGNATURES_LOTNUM45_bm  (1<<5)  /* Lot Number Byte 4, ASCII bit 5 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM45_bp  5  /* Lot Number Byte 4, ASCII bit 5 position. */
#define NVM_PROD_SIGNATURES_LOTNUM46_bm  (1<<6)  /* Lot Number Byte 4, ASCII bit 6 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM46_bp  6  /* Lot Number Byte 4, ASCII bit 6 position. */
#define NVM_PROD_SIGNATURES_LOTNUM47_bm  (1<<7)  /* Lot Number Byte 4, ASCII bit 7 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM47_bp  7  /* Lot Number Byte 4, ASCII bit 7 position. */

/* NVM_PROD_SIGNATURES.LOTNUM5  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_LOTNUM5_gm  0xFF  /* Lot Number Byte 5, ASCII group mask. */
#define NVM_PROD_SIGNATURES_LOTNUM5_gp  0  /* Lot Number Byte 5, ASCII group position. */
#define NVM_PROD_SIGNATURES_LOTNUM50_bm  (1<<0)  /* Lot Number Byte 5, ASCII bit 0 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM50_bp  0  /* Lot Number Byte 5, ASCII bit 0 position. */
#define NVM_PROD_SIGNATURES_LOTNUM51_bm  (1<<1)  /* Lot Number Byte 5, ASCII bit 1 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM51_bp  1  /* Lot Number Byte 5, ASCII bit 1 position. */
#define NVM_PROD_SIGNATURES_LOTNUM52_bm  (1<<2)  /* Lot Number Byte 5, ASCII bit 2 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM52_bp  2  /* Lot Number Byte 5, ASCII bit 2 position. */
#define NVM_PROD_SIGNATURES_LOTNUM53_bm  (1<<3)  /* Lot Number Byte 5, ASCII bit 3 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM53_bp  3  /* Lot Number Byte 5, ASCII bit 3 position. */
#define NVM_PROD_SIGNATURES_LOTNUM54_bm  (1<<4)  /* Lot Number Byte 5, ASCII bit 4 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM54_bp  4  /* Lot Number Byte 5, ASCII bit 4 position. */
#define NVM_PROD_SIGNATURES_LOTNUM55_bm  (1<<5)  /* Lot Number Byte 5, ASCII bit 5 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM55_bp  5  /* Lot Number Byte 5, ASCII bit 5 position. */
#define NVM_PROD_SIGNATURES_LOTNUM56_bm  (1<<6)  /* Lot Number Byte 5, ASCII bit 6 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM56_bp  6  /* Lot Number Byte 5, ASCII bit 6 position. */
#define NVM_PROD_SIGNATURES_LOTNUM57_bm  (1<<7)  /* Lot Number Byte 5, ASCII bit 7 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM57_bp  7  /* Lot Number Byte 5, ASCII bit 7 position. */

