gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts200reva.h
/* NVM_PROD_SIGNATURES.BATTOFFSET  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_BATTOFFSET_gm  0xFF  /* BATT Offset group mask. */
#define NVM_PROD_SIGNATURES_BATTOFFSET_gp  0  /* BATT Offset group position. */
#define NVM_PROD_SIGNATURES_BATTOFFSET0_bm  (1<<0)  /* BATT Offset bit 0 mask. */
#define NVM_PROD_SIGNATURES_BATTOFFSET0_bp  0  /* BATT Offset bit 0 position. */
#define NVM_PROD_SIGNATURES_BATTOFFSET1_bm  (1<<1)  /* BATT Offset bit 1 mask. */
#define NVM_PROD_SIGNATURES_BATTOFFSET1_bp  1  /* BATT Offset bit 1 position. */
#define NVM_PROD_SIGNATURES_BATTOFFSET2_bm  (1<<2)  /* BATT Offset bit 2 mask. */
#define NVM_PROD_SIGNATURES_BATTOFFSET2_bp  2  /* BATT Offset bit 2 position. */
#define NVM_PROD_SIGNATURES_BATTOFFSET3_bm  (1<<3)  /* BATT Offset bit 3 mask. */
#define NVM_PROD_SIGNATURES_BATTOFFSET3_bp  3  /* BATT Offset bit 3 position. */
#define NVM_PROD_SIGNATURES_BATTOFFSET4_bm  (1<<4)  /* BATT Offset bit 4 mask. */
#define NVM_PROD_SIGNATURES_BATTOFFSET4_bp  4  /* BATT Offset bit 4 position. */
#define NVM_PROD_SIGNATURES_BATTOFFSET5_bm  (1<<5)  /* BATT Offset bit 5 mask. */
#define NVM_PROD_SIGNATURES_BATTOFFSET5_bp  5  /* BATT Offset bit 5 position. */
#define NVM_PROD_SIGNATURES_BATTOFFSET6_bm  (1<<6)  /* BATT Offset bit 6 mask. */
#define NVM_PROD_SIGNATURES_BATTOFFSET6_bp  6  /* BATT Offset bit 6 position. */
#define NVM_PROD_SIGNATURES_BATTOFFSET7_bm  (1<<7)  /* BATT Offset bit 7 mask. */
#define NVM_PROD_SIGNATURES_BATTOFFSET7_bp  7  /* BATT Offset bit 7 position. */

/* NVM_PROD_SIGNATURES.BATTGAINL  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_BATTGAINL_gm  0xFF  /* BATT Gain Low Byte group mask. */
#define NVM_PROD_SIGNATURES_BATTGAINL_gp  0  /* BATT Gain Low Byte group position. */
#define NVM_PROD_SIGNATURES_BATTGAINL0_bm  (1<<0)  /* BATT Gain Low Byte bit 0 mask. */
#define NVM_PROD_SIGNATURES_BATTGAINL0_bp  0  /* BATT Gain Low Byte bit 0 position. */
#define NVM_PROD_SIGNATURES_BATTGAINL1_bm  (1<<1)  /* BATT Gain Low Byte bit 1 mask. */
#define NVM_PROD_SIGNATURES_BATTGAINL1_bp  1  /* BATT Gain Low Byte bit 1 position. */
#define NVM_PROD_SIGNATURES_BATTGAINL2_bm  (1<<2)  /* BATT Gain Low Byte bit 2 mask. */
#define NVM_PROD_SIGNATURES_BATTGAINL2_bp  2  /* BATT Gain Low Byte bit 2 position. */
#define NVM_PROD_SIGNATURES_BATTGAINL3_bm  (1<<3)  /* BATT Gain Low Byte bit 3 mask. */
#define NVM_PROD_SIGNATURES_BATTGAINL3_bp  3  /* BATT Gain Low Byte bit 3 position. */
#define NVM_PROD_SIGNATURES_BATTGAINL4_bm  (1<<4)  /* BATT Gain Low Byte bit 4 mask. */
#define NVM_PROD_SIGNATURES_BATTGAINL4_bp  4  /* BATT Gain Low Byte bit 4 position. */
#define NVM_PROD_SIGNATURES_BATTGAINL5_bm  (1<<5)  /* BATT Gain Low Byte bit 5 mask. */
#define NVM_PROD_SIGNATURES_BATTGAINL5_bp  5  /* BATT Gain Low Byte bit 5 position. */
#define NVM_PROD_SIGNATURES_BATTGAINL6_bm  (1<<6)  /* BATT Gain Low Byte bit 6 mask. */
#define NVM_PROD_SIGNATURES_BATTGAINL6_bp  6  /* BATT Gain Low Byte bit 6 position. */
#define NVM_PROD_SIGNATURES_BATTGAINL7_bm  (1<<7)  /* BATT Gain Low Byte bit 7 mask. */
#define NVM_PROD_SIGNATURES_BATTGAINL7_bp  7  /* BATT Gain Low Byte bit 7 position. */

/* NVM_PROD_SIGNATURES.BATTGAINH  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_BATTGAINH_gm  0xFF  /* BATT Gain High Byte group mask. */
#define NVM_PROD_SIGNATURES_BATTGAINH_gp  0  /* BATT Gain High Byte group position. */
#define NVM_PROD_SIGNATURES_BATTGAINH0_bm  (1<<0)  /* BATT Gain High Byte bit 0 mask. */
#define NVM_PROD_SIGNATURES_BATTGAINH0_bp  0  /* BATT Gain High Byte bit 0 position. */
#define NVM_PROD_SIGNATURES_BATTGAINH1_bm  (1<<1)  /* BATT Gain High Byte bit 1 mask. */
#define NVM_PROD_SIGNATURES_BATTGAINH1_bp  1  /* BATT Gain High Byte bit 1 position. */
#define NVM_PROD_SIGNATURES_BATTGAINH2_bm  (1<<2)  /* BATT Gain High Byte bit 2 mask. */
#define NVM_PROD_SIGNATURES_BATTGAINH2_bp  2  /* BATT Gain High Byte bit 2 position. */
#define NVM_PROD_SIGNATURES_BATTGAINH3_bm  (1<<3)  /* BATT Gain High Byte bit 3 mask. */
#define NVM_PROD_SIGNATURES_BATTGAINH3_bp  3  /* BATT Gain High Byte bit 3 position. */
#define NVM_PROD_SIGNATURES_BATTGAINH4_bm  (1<<4)  /* BATT Gain High Byte bit 4 mask. */
#define NVM_PROD_SIGNATURES_BATTGAINH4_bp  4  /* BATT Gain High Byte bit 4 position. */
#define NVM_PROD_SIGNATURES_BATTGAINH5_bm  (1<<5)  /* BATT Gain High Byte bit 5 mask. */
#define NVM_PROD_SIGNATURES_BATTGAINH5_bp  5  /* BATT Gain High Byte bit 5 position. */
#define NVM_PROD_SIGNATURES_BATTGAINH6_bm  (1<<6)  /* BATT Gain High Byte bit 6 mask. */
#define NVM_PROD_SIGNATURES_BATTGAINH6_bp  6  /* BATT Gain High Byte bit 6 position. */
#define NVM_PROD_SIGNATURES_BATTGAINH7_bm  (1<<7)  /* BATT Gain High Byte bit 7 mask. */
#define NVM_PROD_SIGNATURES_BATTGAINH7_bp  7  /* BATT Gain High Byte bit 7 position. */

/* NVM_PROD_SIGNATURES.RXAMPOFFSET  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_RXAMPOFFSET_gm  0x3F  /* RX Amplifier Offset Byte group mask. */
#define NVM_PROD_SIGNATURES_RXAMPOFFSET_gp  0  /* RX Amplifier Offset Byte group position. */
#define NVM_PROD_SIGNATURES_RXAMPOFFSET0_bm  (1<<0)  /* RX Amplifier Offset Byte bit 0 mask. */
#define NVM_PROD_SIGNATURES_RXAMPOFFSET0_bp  0  /* RX Amplifier Offset Byte bit 0 position. */
#define NVM_PROD_SIGNATURES_RXAMPOFFSET1_bm  (1<<1)  /* RX Amplifier Offset Byte bit 1 mask. */
#define NVM_PROD_SIGNATURES_RXAMPOFFSET1_bp  1  /* RX Amplifier Offset Byte bit 1 position. */
#define NVM_PROD_SIGNATURES_RXAMPOFFSET2_bm  (1<<2)  /* RX Amplifier Offset Byte bit 2 mask. */
#define NVM_PROD_SIGNATURES_RXAMPOFFSET2_bp  2  /* RX Amplifier Offset Byte bit 2 position. */
#define NVM_PROD_SIGNATURES_RXAMPOFFSET3_bm  (1<<3)  /* RX Amplifier Offset Byte bit 3 mask. */
#define NVM_PROD_SIGNATURES_RXAMPOFFSET3_bp  3  /* RX Amplifier Offset Byte bit 3 position. */
#define NVM_PROD_SIGNATURES_RXAMPOFFSET4_bm  (1<<4)  /* RX Amplifier Offset Byte bit 4 mask. */
#define NVM_PROD_SIGNATURES_RXAMPOFFSET4_bp  4  /* RX Amplifier Offset Byte bit 4 position. */
#define NVM_PROD_SIGNATURES_RXAMPOFFSET5_bm  (1<<5)  /* RX Amplifier Offset Byte bit 5 mask. */
#define NVM_PROD_SIGNATURES_RXAMPOFFSET5_bp  5  /* RX Amplifier Offset Byte bit 5 position. */

/* NVM_PROD_SIGNATURES.RCCAL24MHZL  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL_gm  0xFF  /* 24MHz RC Oscillator Calibration Low Byte group mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL_gp  0  /* 24MHz RC Oscillator Calibration Low Byte group position. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL0_bm  (1<<0)  /* 24MHz RC Oscillator Calibration Low Byte bit 0 mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL0_bp  0  /* 24MHz RC Oscillator Calibration Low Byte bit 0 position. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL1_bm  (1<<1)  /* 24MHz RC Oscillator Calibration Low Byte bit 1 mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL1_bp  1  /* 24MHz RC Oscillator Calibration Low Byte bit 1 position. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL2_bm  (1<<2)  /* 24MHz RC Oscillator Calibration Low Byte bit 2 mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL2_bp  2  /* 24MHz RC Oscillator Calibration Low Byte bit 2 position. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL3_bm  (1<<3)  /* 24MHz RC Oscillator Calibration Low Byte bit 3 mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL3_bp  3  /* 24MHz RC Oscillator Calibration Low Byte bit 3 position. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL4_bm  (1<<4)  /* 24MHz RC Oscillator Calibration Low Byte bit 4 mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL4_bp  4  /* 24MHz RC Oscillator Calibration Low Byte bit 4 position. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL5_bm  (1<<5)  /* 24MHz RC Oscillator Calibration Low Byte bit 5 mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL5_bp  5  /* 24MHz RC Oscillator Calibration Low Byte bit 5 position. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL6_bm  (1<<6)  /* 24MHz RC Oscillator Calibration Low Byte bit 6 mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL6_bp  6  /* 24MHz RC Oscillator Calibration Low Byte bit 6 position. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL7_bm  (1<<7)  /* 24MHz RC Oscillator Calibration Low Byte bit 7 mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL7_bp  7  /* 24MHz RC Oscillator Calibration Low Byte bit 7 position. */

/* NVM_PROD_SIGNATURES.RCCAL24MHZH  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_RCCAL24MHZH_gm  0x1F  /* 24MHz RC Oscillator Calibration High Byte group mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZH_gp  0  /* 24MHz RC Oscillator Calibration High Byte group position. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZH0_bm  (1<<0)  /* 24MHz RC Oscillator Calibration High Byte bit 0 mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZH0_bp  0  /* 24MHz RC Oscillator Calibration High Byte bit 0 position. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZH1_bm  (1<<1)  /* 24MHz RC Oscillator Calibration High Byte bit 1 mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZH1_bp  1  /* 24MHz RC Oscillator Calibration High Byte bit 1 position. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZH2_bm  (1<<2)  /* 24MHz RC Oscillator Calibration High Byte bit 2 mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZH2_bp  2  /* 24MHz RC Oscillator Calibration High Byte bit 2 position. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZH3_bm  (1<<3)  /* 24MHz RC Oscillator Calibration High Byte bit 3 mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZH3_bp  3  /* 24MHz RC Oscillator Calibration High Byte bit 3 position. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZH4_bm  (1<<4)  /* 24MHz RC Oscillator Calibration High Byte bit 4 mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZH4_bp  4  /* 24MHz RC Oscillator Calibration High Byte bit 4 position. */

/* NVM_PROD_SIGNATURES.ULPRCCALL  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_ULPRCCALL_gm  0xFF  /* ULP RC Oscillator Calibration Low Byte group mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALL_gp  0  /* ULP RC Oscillator Calibration Low Byte group position. */
#define NVM_PROD_SIGNATURES_ULPRCCALL0_bm  (1<<0)  /* ULP RC Oscillator Calibration Low Byte bit 0 mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALL0_bp  0  /* ULP RC Oscillator Calibration Low Byte bit 0 position. */
#define NVM_PROD_SIGNATURES_ULPRCCALL1_bm  (1<<1)  /* ULP RC Oscillator Calibration Low Byte bit 1 mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALL1_bp  1  /* ULP RC Oscillator Calibration Low Byte bit 1 position. */
#define NVM_PROD_SIGNATURES_ULPRCCALL2_bm  (1<<2)  /* ULP RC Oscillator Calibration Low Byte bit 2 mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALL2_bp  2  /* ULP RC Oscillator Calibration Low Byte bit 2 position. */
#define NVM_PROD_SIGNATURES_ULPRCCALL3_bm  (1<<3)  /* ULP RC Oscillator Calibration Low Byte bit 3 mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALL3_bp  3  /* ULP RC Oscillator Calibration Low Byte bit 3 position. */
#define NVM_PROD_SIGNATURES_ULPRCCALL4_bm  (1<<4)  /* ULP RC Oscillator Calibration Low Byte bit 4 mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALL4_bp  4  /* ULP RC Oscillator Calibration Low Byte bit 4 position. */
#define NVM_PROD_SIGNATURES_ULPRCCALL5_bm  (1<<5)  /* ULP RC Oscillator Calibration Low Byte bit 5 mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALL5_bp  5  /* ULP RC Oscillator Calibration Low Byte bit 5 position. */
#define NVM_PROD_SIGNATURES_ULPRCCALL6_bm  (1<<6)  /* ULP RC Oscillator Calibration Low Byte bit 6 mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALL6_bp  6  /* ULP RC Oscillator Calibration Low Byte bit 6 position. */
#define NVM_PROD_SIGNATURES_ULPRCCALL7_bm  (1<<7)  /* ULP RC Oscillator Calibration Low Byte bit 7 mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALL7_bp  7  /* ULP RC Oscillator Calibration Low Byte bit 7 position. */

/* NVM_PROD_SIGNATURES.ULPRCCALH  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_ULPRCCALH_gm  0x1F  /* ULP RC Oscillator Calibration High Byte group mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALH_gp  0  /* ULP RC Oscillator Calibration High Byte group position. */
#define NVM_PROD_SIGNATURES_ULPRCCALH0_bm  (1<<0)  /* ULP RC Oscillator Calibration High Byte bit 0 mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALH0_bp  0  /* ULP RC Oscillator Calibration High Byte bit 0 position. */
#define NVM_PROD_SIGNATURES_ULPRCCALH1_bm  (1<<1)  /* ULP RC Oscillator Calibration High Byte bit 1 mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALH1_bp  1  /* ULP RC Oscillator Calibration High Byte bit 1 position. */
#define NVM_PROD_SIGNATURES_ULPRCCALH2_bm  (1<<2)  /* ULP RC Oscillator Calibration High Byte bit 2 mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALH2_bp  2  /* ULP RC Oscillator Calibration High Byte bit 2 position. */
#define NVM_PROD_SIGNATURES_ULPRCCALH3_bm  (1<<3)  /* ULP RC Oscillator Calibration High Byte bit 3 mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALH3_bp  3  /* ULP RC Oscillator Calibration High Byte bit 3 position. */
#define NVM_PROD_SIGNATURES_ULPRCCALH4_bm  (1<<4)  /* ULP RC Oscillator Calibration High Byte bit 4 mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALH4_bp  4  /* ULP RC Oscillator Calibration High Byte bit 4 position. */

/* NVM_PROD_SIGNATURES.BGCAL  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_BGCAL_gm  0x7F  /* Band Gap Calibration Byte group mask. */
#define NVM_PROD_SIGNATURES_BGCAL_gp  0  /* Band Gap Calibration Byte group position. */
#define NVM_PROD_SIGNATURES_BGCAL0_bm  (1<<0)  /* Band Gap Calibration Byte bit 0 mask. */
#define NVM_PROD_SIGNATURES_BGCAL0_bp  0  /* Band Gap Calibration Byte bit 0 position. */
#define NVM_PROD_SIGNATURES_BGCAL1_bm  (1<<1)  /* Band Gap Calibration Byte bit 1 mask. */
#define NVM_PROD_SIGNATURES_BGCAL1_bp  1  /* Band Gap Calibration Byte bit 1 position. */
#define NVM_PROD_SIGNATURES_BGCAL2_bm  (1<<2)  /* Band Gap Calibration Byte bit 2 mask. */
#define NVM_PROD_SIGNATURES_BGCAL2_bp  2  /* Band Gap Calibration Byte bit 2 position. */
#define NVM_PROD_SIGNATURES_BGCAL3_bm  (1<<3)  /* Band Gap Calibration Byte bit 3 mask. */
#define NVM_PROD_SIGNATURES_BGCAL3_bp  3  /* Band Gap Calibration Byte bit 3 position. */
#define NVM_PROD_SIGNATURES_BGCAL4_bm  (1<<4)  /* Band Gap Calibration Byte bit 4 mask. */
#define NVM_PROD_SIGNATURES_BGCAL4_bp  4  /* Band Gap Calibration Byte bit 4 position. */
#define NVM_PROD_SIGNATURES_BGCAL5_bm  (1<<5)  /* Band Gap Calibration Byte bit 5 mask. */
#define NVM_PROD_SIGNATURES_BGCAL5_bp  5  /* Band Gap Calibration Byte bit 5 position. */
#define NVM_PROD_SIGNATURES_BGCAL6_bm  (1<<6)  /* Band Gap Calibration Byte bit 6 mask. */
#define NVM_PROD_SIGNATURES_BGCAL6_bp  6  /* Band Gap Calibration Byte bit 6 position. */

