gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts200reva.h
/* SIMULATOR - Simulator */
/* SIMULATOR.SIMCTRL0  bit masks and bit positions */
#define SIMULATOR_RXEDGE_NEG_bm  0x01  /* RX Negative Edge Detector bit mask. */
#define SIMULATOR_RXEDGE_NEG_bp  0  /* RX Negative Edge Detector bit position. */
#define SIMULATOR_RXEDGE_POS_bm  0x10  /* RX Positive Edge Detector bit mask. */
#define SIMULATOR_RXEDGE_POS_bp  4  /* RX Positive Edge Detector bit position. */

/* SIMULATOR.SIMCTRL1  bit masks and bit positions */
#define SIMULATOR_TXDATA_bm  0x01  /* TX HV Data bit mask. */
#define SIMULATOR_TXDATA_bp  0  /* TX HV Data bit position. */
#define SIMULATOR_TXHVSEL_bm  0x10  /* TX HV Select bit mask. */
#define SIMULATOR_TXHVSEL_bp  4  /* TX HV Select bit position. */

/* SLEEP - Sleep Controller */
/* SLEEP.CTRL  bit masks and bit positions */
#define SLEEP_SEN_bm  0x01  /* Sleep Enable bit mask. */
#define SLEEP_SEN_bp  0  /* Sleep Enable bit position. */
#define SLEEP_SMODE_gm  0x06  /* Sleep Mode Selection group mask. */
#define SLEEP_SMODE_gp  1  /* Sleep Mode Selection group position. */
#define SLEEP_SMODE0_bm  (1<<1)  /* Sleep Mode Selection bit 0 mask. */
#define SLEEP_SMODE0_bp  1  /* Sleep Mode Selection bit 0 position. */
#define SLEEP_SMODE1_bm  (1<<2)  /* Sleep Mode Selection bit 1 mask. */
#define SLEEP_SMODE1_bp  2  /* Sleep Mode Selection bit 1 position. */

/* STYLUSCOM - Stylus Communication Interface */
/* STYLUSCOM.RXDETA  bit masks and bit positions */
#define STYLUSCOM_ANAEN_bm  0x01  /* Analog transceiver Enable bit mask. */
#define STYLUSCOM_ANAEN_bp  0  /* Analog transceiver Enable bit position. */
#define STYLUSCOM_TXEN_bm  0x02  /* Analog Transmitter Enable bit mask. */
#define STYLUSCOM_TXEN_bp  1  /* Analog Transmitter Enable bit position. */
#define STYLUSCOM_AMP1EN_bm  0x04  /* Amplifier stage 1 Enable bit mask. */
#define STYLUSCOM_AMP1EN_bp  2  /* Amplifier stage 1 Enable bit position. */
#define STYLUSCOM_AMP2EN_bm  0x08  /* Amplifier stage 2 Enable bit mask. */
#define STYLUSCOM_AMP2EN_bp  3  /* Amplifier stage 2 Enable bit position. */
#define STYLUSCOM_PEAKEN_bm  0x10  /* Peak Enable bit mask. */
#define STYLUSCOM_PEAKEN_bp  4  /* Peak Enable bit position. */
#define STYLUSCOM_NCMPEN_bm  0x20  /* Negative edge Comparator Enable bit mask. */
#define STYLUSCOM_NCMPEN_bp  5  /* Negative edge Comparator Enable bit position. */
#define STYLUSCOM_PCMPEN_bm  0x40  /* Positive edge Comparator Enable bit mask. */
#define STYLUSCOM_PCMPEN_bp  6  /* Positive edge Comparator Enable bit position. */
#define STYLUSCOM_RXEN_bm  0x80  /* Digital Receiver Enable bit mask. */
#define STYLUSCOM_RXEN_bp  7  /* Digital Receiver Enable bit position. */

/* STYLUSCOM.RXDETB  bit masks and bit positions */
#define STYLUSCOM_NTHRESHOLD_gm  0x07  /* Negative edge comparator Threshold group mask. */
#define STYLUSCOM_NTHRESHOLD_gp  0  /* Negative edge comparator Threshold group position. */
#define STYLUSCOM_NTHRESHOLD0_bm  (1<<0)  /* Negative edge comparator Threshold bit 0 mask. */
#define STYLUSCOM_NTHRESHOLD0_bp  0  /* Negative edge comparator Threshold bit 0 position. */
#define STYLUSCOM_NTHRESHOLD1_bm  (1<<1)  /* Negative edge comparator Threshold bit 1 mask. */
#define STYLUSCOM_NTHRESHOLD1_bp  1  /* Negative edge comparator Threshold bit 1 position. */
#define STYLUSCOM_NTHRESHOLD2_bm  (1<<2)  /* Negative edge comparator Threshold bit 2 mask. */
#define STYLUSCOM_NTHRESHOLD2_bp  2  /* Negative edge comparator Threshold bit 2 position. */
#define STYLUSCOM_PTHRESOLD_gm  0x38  /* Positive edge comparator Threshold group mask. */
#define STYLUSCOM_PTHRESOLD_gp  3  /* Positive edge comparator Threshold group position. */
#define STYLUSCOM_PTHRESOLD0_bm  (1<<3)  /* Positive edge comparator Threshold bit 0 mask. */
#define STYLUSCOM_PTHRESOLD0_bp  3  /* Positive edge comparator Threshold bit 0 position. */
#define STYLUSCOM_PTHRESOLD1_bm  (1<<4)  /* Positive edge comparator Threshold bit 1 mask. */
#define STYLUSCOM_PTHRESOLD1_bp  4  /* Positive edge comparator Threshold bit 1 position. */
#define STYLUSCOM_PTHRESOLD2_bm  (1<<5)  /* Positive edge comparator Threshold bit 2 mask. */
#define STYLUSCOM_PTHRESOLD2_bp  5  /* Positive edge comparator Threshold bit 2 position. */
#define STYLUSCOM_HYSTRST_bm  0x40  /* Hysteresis Reset bit mask. */
#define STYLUSCOM_HYSTRST_bp  6  /* Hysteresis Reset bit position. */
#define STYLUSCOM_ENHYST_bm  0x80  /* Hysteresis Enable bit mask. */
#define STYLUSCOM_ENHYST_bp  7  /* Hysteresis Enable bit position. */

/* STYLUSCOM.RXDETC  bit masks and bit positions */
#define STYLUSCOM_ADCAVG_bm  0x01  /* ADC Averaging bit mask. */
#define STYLUSCOM_ADCAVG_bp  0  /* ADC Averaging bit position. */
#define STYLUSCOM_PEAKSEL_bm  0x02  /* Peak detector polarity select bit mask. */
#define STYLUSCOM_PEAKSEL_bp  1  /* Peak detector polarity select bit position. */
#define STYLUSCOM_PEAKCAL_bm  0x04  /* peak detector into calibration mode bit mask. */
#define STYLUSCOM_PEAKCAL_bp  2  /* peak detector into calibration mode bit position. */
#define STYLUSCOM_PEAKLONG_bm  0x08  /* peak detector intolong measure mode bit mask. */
#define STYLUSCOM_PEAKLONG_bp  3  /* peak detector intolong measure mode bit position. */
#define STYLUSCOM_CONVDONE_bm  0x10  /* peak detector run until conversion are done bit mask. */
#define STYLUSCOM_CONVDONE_bp  4  /* peak detector run until conversion are done bit position. */

/* STYLUSCOM.RXDETD  bit masks and bit positions */
#define STYLUSCOM_AMP1GAIN_gm  0x03  /* Amplifier stage 1 Gain group mask. */
#define STYLUSCOM_AMP1GAIN_gp  0  /* Amplifier stage 1 Gain group position. */
#define STYLUSCOM_AMP1GAIN0_bm  (1<<0)  /* Amplifier stage 1 Gain bit 0 mask. */
#define STYLUSCOM_AMP1GAIN0_bp  0  /* Amplifier stage 1 Gain bit 0 position. */
#define STYLUSCOM_AMP1GAIN1_bm  (1<<1)  /* Amplifier stage 1 Gain bit 1 mask. */
#define STYLUSCOM_AMP1GAIN1_bp  1  /* Amplifier stage 1 Gain bit 1 position. */
#define STYLUSCOM_AMP2GAIN_gm  0x7C  /* Amplifier stage 2 Gain group mask. */
#define STYLUSCOM_AMP2GAIN_gp  2  /* Amplifier stage 2 Gain group position. */
#define STYLUSCOM_AMP2GAIN0_bm  (1<<2)  /* Amplifier stage 2 Gain bit 0 mask. */
#define STYLUSCOM_AMP2GAIN0_bp  2  /* Amplifier stage 2 Gain bit 0 position. */
#define STYLUSCOM_AMP2GAIN1_bm  (1<<3)  /* Amplifier stage 2 Gain bit 1 mask. */
#define STYLUSCOM_AMP2GAIN1_bp  3  /* Amplifier stage 2 Gain bit 1 position. */
#define STYLUSCOM_AMP2GAIN2_bm  (1<<4)  /* Amplifier stage 2 Gain bit 2 mask. */
#define STYLUSCOM_AMP2GAIN2_bp  4  /* Amplifier stage 2 Gain bit 2 position. */
#define STYLUSCOM_AMP2GAIN3_bm  (1<<5)  /* Amplifier stage 2 Gain bit 3 mask. */
#define STYLUSCOM_AMP2GAIN3_bp  5  /* Amplifier stage 2 Gain bit 3 position. */
#define STYLUSCOM_AMP2GAIN4_bm  (1<<6)  /* Amplifier stage 2 Gain bit 4 mask. */
#define STYLUSCOM_AMP2GAIN4_bp  6  /* Amplifier stage 2 Gain bit 4 position. */

/* STYLUSCOM.RXDETE  bit masks and bit positions */
#define STYLUSCOM_RXBBYP_gm  0x03  /* Receive Amplifier Bypass group mask. */
#define STYLUSCOM_RXBBYP_gp  0  /* Receive Amplifier Bypass group position. */
#define STYLUSCOM_RXBBYP0_bm  (1<<0)  /* Receive Amplifier Bypass bit 0 mask. */
#define STYLUSCOM_RXBBYP0_bp  0  /* Receive Amplifier Bypass bit 0 position. */
#define STYLUSCOM_RXBBYP1_bm  (1<<1)  /* Receive Amplifier Bypass bit 1 mask. */
#define STYLUSCOM_RXBBYP1_bp  1  /* Receive Amplifier Bypass bit 1 position. */
#define STYLUSCOM_OFFSETCAL_gm  0xFC  /* Amplifier Offset Calibration group mask. */
#define STYLUSCOM_OFFSETCAL_gp  2  /* Amplifier Offset Calibration group position. */
#define STYLUSCOM_OFFSETCAL0_bm  (1<<2)  /* Amplifier Offset Calibration bit 0 mask. */
#define STYLUSCOM_OFFSETCAL0_bp  2  /* Amplifier Offset Calibration bit 0 position. */
#define STYLUSCOM_OFFSETCAL1_bm  (1<<3)  /* Amplifier Offset Calibration bit 1 mask. */
#define STYLUSCOM_OFFSETCAL1_bp  3  /* Amplifier Offset Calibration bit 1 position. */
#define STYLUSCOM_OFFSETCAL2_bm  (1<<4)  /* Amplifier Offset Calibration bit 2 mask. */
#define STYLUSCOM_OFFSETCAL2_bp  4  /* Amplifier Offset Calibration bit 2 position. */
#define STYLUSCOM_OFFSETCAL3_bm  (1<<5)  /* Amplifier Offset Calibration bit 3 mask. */
#define STYLUSCOM_OFFSETCAL3_bp  5  /* Amplifier Offset Calibration bit 3 position. */
#define STYLUSCOM_OFFSETCAL4_bm  (1<<6)  /* Amplifier Offset Calibration bit 4 mask. */
#define STYLUSCOM_OFFSETCAL4_bp  6  /* Amplifier Offset Calibration bit 4 position. */
#define STYLUSCOM_OFFSETCAL5_bm  (1<<7)  /* Amplifier Offset Calibration bit 5 mask. */
#define STYLUSCOM_OFFSETCAL5_bp  7  /* Amplifier Offset Calibration bit 5 position. */

