gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts200reva.h
/* STYLUSCOM.RXDETF  bit masks and bit positions */
#define STYLUSCOM_AMPSPEED_bm  0x01  /* Amplifier Speed bit mask. */
#define STYLUSCOM_AMPSPEED_bp  0  /* Amplifier Speed bit position. */
#define STYLUSCOM_AMPAOFF_bm  0x02  /* Receive Amplifier automatic off bit mask. */
#define STYLUSCOM_AMPAOFF_bp  1  /* Receive Amplifier automatic off bit position. */

/* STYLUSCOM.TMCTRLA  bit masks and bit positions */
#define STYLUSCOM_ENRXOVS_bm  0x01  /* Enable RX Override Signals bit mask. */
#define STYLUSCOM_ENRXOVS_bp  0  /* Enable RX Override Signals bit position. */
#define STYLUSCOM_OVRXDIS_bm  0x02  /* Override RX disable signal bit mask. */
#define STYLUSCOM_OVRXDIS_bp  1  /* Override RX disable signal bit position. */
#define STYLUSCOM_OVRXCLAMP_bm  0x04  /* Override RX clamp signal bit mask. */
#define STYLUSCOM_OVRXCLAMP_bp  2  /* Override RX clamp signal bit position. */
#define STYLUSCOM_AMPTOUT_bm  0x08  /* Amplifier test output enable bit mask. */
#define STYLUSCOM_AMPTOUT_bp  3  /* Amplifier test output enable bit position. */
#define STYLUSCOM_TESTGAIN_bm  0x10  /* Amplifier test mode for gain measurements bit mask. */
#define STYLUSCOM_TESTGAIN_bp  4  /* Amplifier test mode for gain measurements bit position. */
#define STYLUSCOM_EDTIN_bm  0x20  /* Edge Detector Test Input enable Offset bit mask. */
#define STYLUSCOM_EDTIN_bp  5  /* Edge Detector Test Input enable Offset bit position. */
#define STYLUSCOM_FRESLADEN_bm  0x40  /* Force on edge detector RESistor LADder Enable bit mask. */
#define STYLUSCOM_FRESLADEN_bp  6  /* Force on edge detector RESistor LADder Enable bit position. */

/* STYLUSCOM.TMCTRLB  bit masks and bit positions */
#define STYLUSCOM_PBYPASS_bm  0x01  /* Peak Detector Bypass Enable bit mask. */
#define STYLUSCOM_PBYPASS_bp  0  /* Peak Detector Bypass Enable bit position. */
#define STYLUSCOM_PBUFEN_bm  0x02  /* Peak Detector Output Buffer enable bit mask. */
#define STYLUSCOM_PBUFEN_bp  1  /* Peak Detector Output Buffer enable bit position. */
#define STYLUSCOM_OVPFSM_bm  0x04  /* Override Peak Detector FSM bit mask. */
#define STYLUSCOM_OVPFSM_bp  2  /* Override Peak Detector FSM bit position. */

/* STYLUSCOM.TMPEAK  bit masks and bit positions */
#define STYLUSCOM_NSEL_bm  0x01  /* Peak Detector Negative input select bit mask. */
#define STYLUSCOM_NSEL_bp  0  /* Peak Detector Negative input select bit position. */
#define STYLUSCOM_PSEL_bm  0x02  /* Peak Detector Positive input select bit mask. */
#define STYLUSCOM_PSEL_bp  1  /* Peak Detector Positive input select bit position. */
#define STYLUSCOM_ENCAP_gm  0x1C  /* Enable Peak Detector Capacitors group mask. */
#define STYLUSCOM_ENCAP_gp  2  /* Enable Peak Detector Capacitors group position. */
#define STYLUSCOM_ENCAP0_bm  (1<<2)  /* Enable Peak Detector Capacitors bit 0 mask. */
#define STYLUSCOM_ENCAP0_bp  2  /* Enable Peak Detector Capacitors bit 0 position. */
#define STYLUSCOM_ENCAP1_bm  (1<<3)  /* Enable Peak Detector Capacitors bit 1 mask. */
#define STYLUSCOM_ENCAP1_bp  3  /* Enable Peak Detector Capacitors bit 1 position. */
#define STYLUSCOM_ENCAP2_bm  (1<<4)  /* Enable Peak Detector Capacitors bit 2 mask. */
#define STYLUSCOM_ENCAP2_bp  4  /* Enable Peak Detector Capacitors bit 2 position. */
#define STYLUSCOM_RESETCAP_gm  0xE0  /* Reset Peak Detector Capacitors group mask. */
#define STYLUSCOM_RESETCAP_gp  5  /* Reset Peak Detector Capacitors group position. */
#define STYLUSCOM_RESETCAP0_bm  (1<<5)  /* Reset Peak Detector Capacitors bit 0 mask. */
#define STYLUSCOM_RESETCAP0_bp  5  /* Reset Peak Detector Capacitors bit 0 position. */
#define STYLUSCOM_RESETCAP1_bm  (1<<6)  /* Reset Peak Detector Capacitors bit 1 mask. */
#define STYLUSCOM_RESETCAP1_bp  6  /* Reset Peak Detector Capacitors bit 1 position. */
#define STYLUSCOM_RESETCAP2_bm  (1<<7)  /* Reset Peak Detector Capacitors bit 2 mask. */
#define STYLUSCOM_RESETCAP2_bp  7  /* Reset Peak Detector Capacitors bit 2 position. */

/* STYLUSCOM.CTRLA  bit masks and bit positions */
#define STYLUSCOM_HS_gm  0x07  /* Header Size group mask. */
#define STYLUSCOM_HS_gp  0  /* Header Size group position. */
#define STYLUSCOM_HS0_bm  (1<<0)  /* Header Size bit 0 mask. */
#define STYLUSCOM_HS0_bp  0  /* Header Size bit 0 position. */
#define STYLUSCOM_HS1_bm  (1<<1)  /* Header Size bit 1 mask. */
#define STYLUSCOM_HS1_bp  1  /* Header Size bit 1 position. */
#define STYLUSCOM_HS2_bm  (1<<2)  /* Header Size bit 2 mask. */
#define STYLUSCOM_HS2_bp  2  /* Header Size bit 2 position. */
#define STYLUSCOM_HTE_bm  0x08  /* Header Transmit Enable bit mask. */
#define STYLUSCOM_HTE_bp  3  /* Header Transmit Enable bit position. */
#define STYLUSCOM_WUFD_gm  0x30  /* Window Uncertainty Factor - Data phase group mask. */
#define STYLUSCOM_WUFD_gp  4  /* Window Uncertainty Factor - Data phase group position. */
#define STYLUSCOM_WUFD0_bm  (1<<4)  /* Window Uncertainty Factor - Data phase bit 0 mask. */
#define STYLUSCOM_WUFD0_bp  4  /* Window Uncertainty Factor - Data phase bit 0 position. */
#define STYLUSCOM_WUFD1_bm  (1<<5)  /* Window Uncertainty Factor - Data phase bit 1 mask. */
#define STYLUSCOM_WUFD1_bp  5  /* Window Uncertainty Factor - Data phase bit 1 position. */
#define STYLUSCOM_WUFE_gm  0xC0  /* Window Uncertainty Factor for Estimation phase group mask. */
#define STYLUSCOM_WUFE_gp  6  /* Window Uncertainty Factor for Estimation phase group position. */
#define STYLUSCOM_WUFE0_bm  (1<<6)  /* Window Uncertainty Factor for Estimation phase bit 0 mask. */
#define STYLUSCOM_WUFE0_bp  6  /* Window Uncertainty Factor for Estimation phase bit 0 position. */
#define STYLUSCOM_WUFE1_bm  (1<<7)  /* Window Uncertainty Factor for Estimation phase bit 1 mask. */
#define STYLUSCOM_WUFE1_bp  7  /* Window Uncertainty Factor for Estimation phase bit 1 position. */

/* STYLUSCOM.CTRLB  bit masks and bit positions */
#define STYLUSCOM_EXPEE_bm  0x01  /* Expected half period Estimation Enable bit mask. */
#define STYLUSCOM_EXPEE_bp  0  /* Expected half period Estimation Enable bit position. */
#define STYLUSCOM_WINEE_bm  0x02  /* Window Estimation Enable bit mask. */
#define STYLUSCOM_WINEE_bp  1  /* Window Estimation Enable bit position. */
#define STYLUSCOM_TEEE_bm  0x04  /* RESERVED/Transmit at Estimated Edges Enable bit mask. */
#define STYLUSCOM_TEEE_bp  2  /* RESERVED/Transmit at Estimated Edges Enable bit position. */
#define STYLUSCOM_TSP_gm  0x38  /* Transmission Signal Polarity group mask. */
#define STYLUSCOM_TSP_gp  3  /* Transmission Signal Polarity group position. */
#define STYLUSCOM_TSP0_bm  (1<<3)  /* Transmission Signal Polarity bit 0 mask. */
#define STYLUSCOM_TSP0_bp  3  /* Transmission Signal Polarity bit 0 position. */
#define STYLUSCOM_TSP1_bm  (1<<4)  /* Transmission Signal Polarity bit 1 mask. */
#define STYLUSCOM_TSP1_bp  4  /* Transmission Signal Polarity bit 1 position. */
#define STYLUSCOM_TSP2_bm  (1<<5)  /* Transmission Signal Polarity bit 2 mask. */
#define STYLUSCOM_TSP2_bp  5  /* Transmission Signal Polarity bit 2 position. */
#define STYLUSCOM_TOVE_bm  0x40  /* Transmit Override Enable bit mask. */
#define STYLUSCOM_TOVE_bp  6  /* Transmit Override Enable bit position. */
#define STYLUSCOM_TPDEN_bm  0x80  /* Transmit Pulldown Enable bit mask. */
#define STYLUSCOM_TPDEN_bp  7  /* Transmit Pulldown Enable bit position. */

/* STYLUSCOM.CTRLC  bit masks and bit positions */
#define STYLUSCOM_NEDOS_bm  0x01  /* Negative Edge Detect Override Strobe bit mask. */
#define STYLUSCOM_NEDOS_bp  0  /* Negative Edge Detect Override Strobe bit position. */
#define STYLUSCOM_PEDOS_bm  0x02  /* Positive Edge Detect Override Strobe bit mask. */
#define STYLUSCOM_PEDOS_bp  1  /* Positive Edge Detect Override Strobe bit position. */
#define STYLUSCOM_AFOS_bm  0x04  /* Abort Frame Override Strobe bit mask. */
#define STYLUSCOM_AFOS_bp  2  /* Abort Frame Override Strobe bit position. */
#define STYLUSCOM_SHOS_bm  0x08  /* Start Header Override Strobe bit mask. */
#define STYLUSCOM_SHOS_bp  3  /* Start Header Override Strobe bit position. */
#define STYLUSCOM_EHOS_bm  0x10  /* End Header Override Strobe bit mask. */
#define STYLUSCOM_EHOS_bp  4  /* End Header Override Strobe bit position. */
#define STYLUSCOM_PDRST_bm  0x20  /* Peak detector Reset Strobe bit mask. */
#define STYLUSCOM_PDRST_bp  5  /* Peak detector Reset Strobe bit position. */

/* STYLUSCOM.CTRLD  bit masks and bit positions */
#define STYLUSCOM_ICSEL_gm  0x07  /* Input Capture Selection group mask. */
#define STYLUSCOM_ICSEL_gp  0  /* Input Capture Selection group position. */
#define STYLUSCOM_ICSEL0_bm  (1<<0)  /* Input Capture Selection bit 0 mask. */
#define STYLUSCOM_ICSEL0_bp  0  /* Input Capture Selection bit 0 position. */
#define STYLUSCOM_ICSEL1_bm  (1<<1)  /* Input Capture Selection bit 1 mask. */
#define STYLUSCOM_ICSEL1_bp  1  /* Input Capture Selection bit 1 position. */
#define STYLUSCOM_ICSEL2_bm  (1<<2)  /* Input Capture Selection bit 2 mask. */
#define STYLUSCOM_ICSEL2_bp  2  /* Input Capture Selection bit 2 position. */
#define STYLUSCOM_EEM_gm  0x18  /* Estimated Edges Max group mask. */
#define STYLUSCOM_EEM_gp  3  /* Estimated Edges Max group position. */
#define STYLUSCOM_EEM0_bm  (1<<3)  /* Estimated Edges Max bit 0 mask. */
#define STYLUSCOM_EEM0_bp  3  /* Estimated Edges Max bit 0 position. */
#define STYLUSCOM_EEM1_bm  (1<<4)  /* Estimated Edges Max bit 1 mask. */
#define STYLUSCOM_EEM1_bp  4  /* Estimated Edges Max bit 1 position. */
#define STYLUSCOM_MEDIAN5_bm  0x20  /* Median of 5 values bit mask. */
#define STYLUSCOM_MEDIAN5_bp  5  /* Median of 5 values bit position. */

/* STYLUSCOM.TDS  bit masks and bit positions */
#define STYLUSCOM_TDS_gm  0x3F  /* Transmit Data Size group mask. */
#define STYLUSCOM_TDS_gp  0  /* Transmit Data Size group position. */
#define STYLUSCOM_TDS0_bm  (1<<0)  /* Transmit Data Size bit 0 mask. */
#define STYLUSCOM_TDS0_bp  0  /* Transmit Data Size bit 0 position. */
#define STYLUSCOM_TDS1_bm  (1<<1)  /* Transmit Data Size bit 1 mask. */
#define STYLUSCOM_TDS1_bp  1  /* Transmit Data Size bit 1 position. */
#define STYLUSCOM_TDS2_bm  (1<<2)  /* Transmit Data Size bit 2 mask. */
#define STYLUSCOM_TDS2_bp  2  /* Transmit Data Size bit 2 position. */
#define STYLUSCOM_TDS3_bm  (1<<3)  /* Transmit Data Size bit 3 mask. */
#define STYLUSCOM_TDS3_bp  3  /* Transmit Data Size bit 3 position. */
#define STYLUSCOM_TDS4_bm  (1<<4)  /* Transmit Data Size bit 4 mask. */
#define STYLUSCOM_TDS4_bp  4  /* Transmit Data Size bit 4 position. */
#define STYLUSCOM_TDS5_bm  (1<<5)  /* Transmit Data Size bit 5 mask. */
#define STYLUSCOM_TDS5_bp  5  /* Transmit Data Size bit 5 position. */

/* STYLUSCOM.TCNT  bit masks and bit positions */
#define STYLUSCOM_TCNT_gm  0x3F  /* Transmit Counter group mask. */
#define STYLUSCOM_TCNT_gp  0  /* Transmit Counter group position. */
#define STYLUSCOM_TCNT0_bm  (1<<0)  /* Transmit Counter bit 0 mask. */
#define STYLUSCOM_TCNT0_bp  0  /* Transmit Counter bit 0 position. */
#define STYLUSCOM_TCNT1_bm  (1<<1)  /* Transmit Counter bit 1 mask. */
#define STYLUSCOM_TCNT1_bp  1  /* Transmit Counter bit 1 position. */
#define STYLUSCOM_TCNT2_bm  (1<<2)  /* Transmit Counter bit 2 mask. */
#define STYLUSCOM_TCNT2_bp  2  /* Transmit Counter bit 2 position. */
#define STYLUSCOM_TCNT3_bm  (1<<3)  /* Transmit Counter bit 3 mask. */
#define STYLUSCOM_TCNT3_bp  3  /* Transmit Counter bit 3 position. */
#define STYLUSCOM_TCNT4_bm  (1<<4)  /* Transmit Counter bit 4 mask. */
#define STYLUSCOM_TCNT4_bp  4  /* Transmit Counter bit 4 position. */
#define STYLUSCOM_TCNT5_bm  (1<<5)  /* Transmit Counter bit 5 mask. */
#define STYLUSCOM_TCNT5_bp  5  /* Transmit Counter bit 5 position. */

/* STYLUSCOM.TDLYINIT  bit masks and bit positions */
#define STYLUSCOM_TDLYINIT_gm  0xFF  /* Transmit Delay Initial value group mask. */
#define STYLUSCOM_TDLYINIT_gp  0  /* Transmit Delay Initial value group position. */
#define STYLUSCOM_TDLYINIT0_bm  (1<<0)  /* Transmit Delay Initial value bit 0 mask. */
#define STYLUSCOM_TDLYINIT0_bp  0  /* Transmit Delay Initial value bit 0 position. */
#define STYLUSCOM_TDLYINIT1_bm  (1<<1)  /* Transmit Delay Initial value bit 1 mask. */
#define STYLUSCOM_TDLYINIT1_bp  1  /* Transmit Delay Initial value bit 1 position. */
#define STYLUSCOM_TDLYINIT2_bm  (1<<2)  /* Transmit Delay Initial value bit 2 mask. */
#define STYLUSCOM_TDLYINIT2_bp  2  /* Transmit Delay Initial value bit 2 position. */
#define STYLUSCOM_TDLYINIT3_bm  (1<<3)  /* Transmit Delay Initial value bit 3 mask. */
#define STYLUSCOM_TDLYINIT3_bp  3  /* Transmit Delay Initial value bit 3 position. */
#define STYLUSCOM_TDLYINIT4_bm  (1<<4)  /* Transmit Delay Initial value bit 4 mask. */
#define STYLUSCOM_TDLYINIT4_bp  4  /* Transmit Delay Initial value bit 4 position. */
#define STYLUSCOM_TDLYINIT5_bm  (1<<5)  /* Transmit Delay Initial value bit 5 mask. */
#define STYLUSCOM_TDLYINIT5_bp  5  /* Transmit Delay Initial value bit 5 position. */
#define STYLUSCOM_TDLYINIT6_bm  (1<<6)  /* Transmit Delay Initial value bit 6 mask. */
#define STYLUSCOM_TDLYINIT6_bp  6  /* Transmit Delay Initial value bit 6 position. */
#define STYLUSCOM_TDLYINIT7_bm  (1<<7)  /* Transmit Delay Initial value bit 7 mask. */
#define STYLUSCOM_TDLYINIT7_bp  7  /* Transmit Delay Initial value bit 7 position. */

/* STYLUSCOM.TDLYCLAMP  bit masks and bit positions */
#define STYLUSCOM_TDLYCLAMP_gm  0xFF  /* Transmit Delay for Receiver Clamp Tipe group mask. */
#define STYLUSCOM_TDLYCLAMP_gp  0  /* Transmit Delay for Receiver Clamp Tipe group position. */
#define STYLUSCOM_TDLYCLAMP0_bm  (1<<0)  /* Transmit Delay for Receiver Clamp Tipe bit 0 mask. */
#define STYLUSCOM_TDLYCLAMP0_bp  0  /* Transmit Delay for Receiver Clamp Tipe bit 0 position. */
#define STYLUSCOM_TDLYCLAMP1_bm  (1<<1)  /* Transmit Delay for Receiver Clamp Tipe bit 1 mask. */
#define STYLUSCOM_TDLYCLAMP1_bp  1  /* Transmit Delay for Receiver Clamp Tipe bit 1 position. */
#define STYLUSCOM_TDLYCLAMP2_bm  (1<<2)  /* Transmit Delay for Receiver Clamp Tipe bit 2 mask. */
#define STYLUSCOM_TDLYCLAMP2_bp  2  /* Transmit Delay for Receiver Clamp Tipe bit 2 position. */
#define STYLUSCOM_TDLYCLAMP3_bm  (1<<3)  /* Transmit Delay for Receiver Clamp Tipe bit 3 mask. */
#define STYLUSCOM_TDLYCLAMP3_bp  3  /* Transmit Delay for Receiver Clamp Tipe bit 3 position. */
#define STYLUSCOM_TDLYCLAMP4_bm  (1<<4)  /* Transmit Delay for Receiver Clamp Tipe bit 4 mask. */
#define STYLUSCOM_TDLYCLAMP4_bp  4  /* Transmit Delay for Receiver Clamp Tipe bit 4 position. */
#define STYLUSCOM_TDLYCLAMP5_bm  (1<<5)  /* Transmit Delay for Receiver Clamp Tipe bit 5 mask. */
#define STYLUSCOM_TDLYCLAMP5_bp  5  /* Transmit Delay for Receiver Clamp Tipe bit 5 position. */
#define STYLUSCOM_TDLYCLAMP6_bm  (1<<6)  /* Transmit Delay for Receiver Clamp Tipe bit 6 mask. */
#define STYLUSCOM_TDLYCLAMP6_bp  6  /* Transmit Delay for Receiver Clamp Tipe bit 6 position. */
#define STYLUSCOM_TDLYCLAMP7_bm  (1<<7)  /* Transmit Delay for Receiver Clamp Tipe bit 7 mask. */
#define STYLUSCOM_TDLYCLAMP7_bp  7  /* Transmit Delay for Receiver Clamp Tipe bit 7 position. */

