gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts200reva.h
/* STYLUSCOM.TDLYRXDIS  bit masks and bit positions */
#define STYLUSCOM_TDLYRXDIS_gm  0x0F  /* Transmit Receiver Delay Disable group mask. */
#define STYLUSCOM_TDLYRXDIS_gp  0  /* Transmit Receiver Delay Disable group position. */
#define STYLUSCOM_TDLYRXDIS0_bm  (1<<0)  /* Transmit Receiver Delay Disable bit 0 mask. */
#define STYLUSCOM_TDLYRXDIS0_bp  0  /* Transmit Receiver Delay Disable bit 0 position. */
#define STYLUSCOM_TDLYRXDIS1_bm  (1<<1)  /* Transmit Receiver Delay Disable bit 1 mask. */
#define STYLUSCOM_TDLYRXDIS1_bp  1  /* Transmit Receiver Delay Disable bit 1 position. */
#define STYLUSCOM_TDLYRXDIS2_bm  (1<<2)  /* Transmit Receiver Delay Disable bit 2 mask. */
#define STYLUSCOM_TDLYRXDIS2_bp  2  /* Transmit Receiver Delay Disable bit 2 position. */
#define STYLUSCOM_TDLYRXDIS3_bm  (1<<3)  /* Transmit Receiver Delay Disable bit 3 mask. */
#define STYLUSCOM_TDLYRXDIS3_bp  3  /* Transmit Receiver Delay Disable bit 3 position. */

/* STYLUSCOM.TDLYCNT  bit masks and bit positions */
/* STYLUSCOM_TCNT  is already defined. */

/* STYLUSCOM.TRCNT  bit masks and bit positions */
#define STYLUSCOM_TRCNT_gm  0x07  /* Transmit Repeat Counter group mask. */
#define STYLUSCOM_TRCNT_gp  0  /* Transmit Repeat Counter group position. */
#define STYLUSCOM_TRCNT0_bm  (1<<0)  /* Transmit Repeat Counter bit 0 mask. */
#define STYLUSCOM_TRCNT0_bp  0  /* Transmit Repeat Counter bit 0 position. */
#define STYLUSCOM_TRCNT1_bm  (1<<1)  /* Transmit Repeat Counter bit 1 mask. */
#define STYLUSCOM_TRCNT1_bp  1  /* Transmit Repeat Counter bit 1 position. */
#define STYLUSCOM_TRCNT2_bm  (1<<2)  /* Transmit Repeat Counter bit 2 mask. */
#define STYLUSCOM_TRCNT2_bp  2  /* Transmit Repeat Counter bit 2 position. */

/* STYLUSCOM.TREP  bit masks and bit positions */
#define STYLUSCOM_TREP_gm  0x0F  /* Transmission Repeat group mask. */
#define STYLUSCOM_TREP_gp  0  /* Transmission Repeat group position. */
#define STYLUSCOM_TREP0_bm  (1<<0)  /* Transmission Repeat bit 0 mask. */
#define STYLUSCOM_TREP0_bp  0  /* Transmission Repeat bit 0 position. */
#define STYLUSCOM_TREP1_bm  (1<<1)  /* Transmission Repeat bit 1 mask. */
#define STYLUSCOM_TREP1_bp  1  /* Transmission Repeat bit 1 position. */
#define STYLUSCOM_TREP2_bm  (1<<2)  /* Transmission Repeat bit 2 mask. */
#define STYLUSCOM_TREP2_bp  2  /* Transmission Repeat bit 2 position. */
#define STYLUSCOM_TREP3_bm  (1<<3)  /* Transmission Repeat bit 3 mask. */
#define STYLUSCOM_TREP3_bp  3  /* Transmission Repeat bit 3 position. */

/* STYLUSCOM.RTWEXPMI  bit masks and bit positions */
#define STYLUSCOM_WEXPMI_gm  0xFF  /* Window EXPected Mark period - initial value group mask. */
#define STYLUSCOM_WEXPMI_gp  0  /* Window EXPected Mark period - initial value group position. */
#define STYLUSCOM_WEXPMI0_bm  (1<<0)  /* Window EXPected Mark period - initial value bit 0 mask. */
#define STYLUSCOM_WEXPMI0_bp  0  /* Window EXPected Mark period - initial value bit 0 position. */
#define STYLUSCOM_WEXPMI1_bm  (1<<1)  /* Window EXPected Mark period - initial value bit 1 mask. */
#define STYLUSCOM_WEXPMI1_bp  1  /* Window EXPected Mark period - initial value bit 1 position. */
#define STYLUSCOM_WEXPMI2_bm  (1<<2)  /* Window EXPected Mark period - initial value bit 2 mask. */
#define STYLUSCOM_WEXPMI2_bp  2  /* Window EXPected Mark period - initial value bit 2 position. */
#define STYLUSCOM_WEXPMI3_bm  (1<<3)  /* Window EXPected Mark period - initial value bit 3 mask. */
#define STYLUSCOM_WEXPMI3_bp  3  /* Window EXPected Mark period - initial value bit 3 position. */
#define STYLUSCOM_WEXPMI4_bm  (1<<4)  /* Window EXPected Mark period - initial value bit 4 mask. */
#define STYLUSCOM_WEXPMI4_bp  4  /* Window EXPected Mark period - initial value bit 4 position. */
#define STYLUSCOM_WEXPMI5_bm  (1<<5)  /* Window EXPected Mark period - initial value bit 5 mask. */
#define STYLUSCOM_WEXPMI5_bp  5  /* Window EXPected Mark period - initial value bit 5 position. */
#define STYLUSCOM_WEXPMI6_bm  (1<<6)  /* Window EXPected Mark period - initial value bit 6 mask. */
#define STYLUSCOM_WEXPMI6_bp  6  /* Window EXPected Mark period - initial value bit 6 position. */
#define STYLUSCOM_WEXPMI7_bm  (1<<7)  /* Window EXPected Mark period - initial value bit 7 mask. */
#define STYLUSCOM_WEXPMI7_bp  7  /* Window EXPected Mark period - initial value bit 7 position. */

/* STYLUSCOM.RTWEXPSI  bit masks and bit positions */
#define STYLUSCOM_WEXPSI_gm  0xFF  /* Window EXPected Space period - initial value group mask. */
#define STYLUSCOM_WEXPSI_gp  0  /* Window EXPected Space period - initial value group position. */
#define STYLUSCOM_WEXPSI0_bm  (1<<0)  /* Window EXPected Space period - initial value bit 0 mask. */
#define STYLUSCOM_WEXPSI0_bp  0  /* Window EXPected Space period - initial value bit 0 position. */
#define STYLUSCOM_WEXPSI1_bm  (1<<1)  /* Window EXPected Space period - initial value bit 1 mask. */
#define STYLUSCOM_WEXPSI1_bp  1  /* Window EXPected Space period - initial value bit 1 position. */
#define STYLUSCOM_WEXPSI2_bm  (1<<2)  /* Window EXPected Space period - initial value bit 2 mask. */
#define STYLUSCOM_WEXPSI2_bp  2  /* Window EXPected Space period - initial value bit 2 position. */
#define STYLUSCOM_WEXPSI3_bm  (1<<3)  /* Window EXPected Space period - initial value bit 3 mask. */
#define STYLUSCOM_WEXPSI3_bp  3  /* Window EXPected Space period - initial value bit 3 position. */
#define STYLUSCOM_WEXPSI4_bm  (1<<4)  /* Window EXPected Space period - initial value bit 4 mask. */
#define STYLUSCOM_WEXPSI4_bp  4  /* Window EXPected Space period - initial value bit 4 position. */
#define STYLUSCOM_WEXPSI5_bm  (1<<5)  /* Window EXPected Space period - initial value bit 5 mask. */
#define STYLUSCOM_WEXPSI5_bp  5  /* Window EXPected Space period - initial value bit 5 position. */
#define STYLUSCOM_WEXPSI6_bm  (1<<6)  /* Window EXPected Space period - initial value bit 6 mask. */
#define STYLUSCOM_WEXPSI6_bp  6  /* Window EXPected Space period - initial value bit 6 position. */
#define STYLUSCOM_WEXPSI7_bm  (1<<7)  /* Window EXPected Space period - initial value bit 7 mask. */
#define STYLUSCOM_WEXPSI7_bp  7  /* Window EXPected Space period - initial value bit 7 position. */

/* STYLUSCOM.RTWEXPMUL  bit masks and bit positions */
#define STYLUSCOM_WEXPMU_gm  0xFF  /* Window EXPected Mark period Used group mask. */
#define STYLUSCOM_WEXPMU_gp  0  /* Window EXPected Mark period Used group position. */
#define STYLUSCOM_WEXPMU0_bm  (1<<0)  /* Window EXPected Mark period Used bit 0 mask. */
#define STYLUSCOM_WEXPMU0_bp  0  /* Window EXPected Mark period Used bit 0 position. */
#define STYLUSCOM_WEXPMU1_bm  (1<<1)  /* Window EXPected Mark period Used bit 1 mask. */
#define STYLUSCOM_WEXPMU1_bp  1  /* Window EXPected Mark period Used bit 1 position. */
#define STYLUSCOM_WEXPMU2_bm  (1<<2)  /* Window EXPected Mark period Used bit 2 mask. */
#define STYLUSCOM_WEXPMU2_bp  2  /* Window EXPected Mark period Used bit 2 position. */
#define STYLUSCOM_WEXPMU3_bm  (1<<3)  /* Window EXPected Mark period Used bit 3 mask. */
#define STYLUSCOM_WEXPMU3_bp  3  /* Window EXPected Mark period Used bit 3 position. */
#define STYLUSCOM_WEXPMU4_bm  (1<<4)  /* Window EXPected Mark period Used bit 4 mask. */
#define STYLUSCOM_WEXPMU4_bp  4  /* Window EXPected Mark period Used bit 4 position. */
#define STYLUSCOM_WEXPMU5_bm  (1<<5)  /* Window EXPected Mark period Used bit 5 mask. */
#define STYLUSCOM_WEXPMU5_bp  5  /* Window EXPected Mark period Used bit 5 position. */
#define STYLUSCOM_WEXPMU6_bm  (1<<6)  /* Window EXPected Mark period Used bit 6 mask. */
#define STYLUSCOM_WEXPMU6_bp  6  /* Window EXPected Mark period Used bit 6 position. */
#define STYLUSCOM_WEXPMU7_bm  (1<<7)  /* Window EXPected Mark period Used bit 7 mask. */
#define STYLUSCOM_WEXPMU7_bp  7  /* Window EXPected Mark period Used bit 7 position. */

/* STYLUSCOM.RTWEXPMUH  bit masks and bit positions */
/* STYLUSCOM_WEXPMU  is already defined. */
#define STYLUSCOM_SORT_bm  0x02  /* Sorting is in progress result not valid bit mask. */
#define STYLUSCOM_SORT_bp  1  /* Sorting is in progress result not valid bit position. */

/* STYLUSCOM.RTWEXPSUL  bit masks and bit positions */
#define STYLUSCOM_WEXPSU_gm  0xFF  /* Window EXPected Space period Used group mask. */
#define STYLUSCOM_WEXPSU_gp  0  /* Window EXPected Space period Used group position. */
#define STYLUSCOM_WEXPSU0_bm  (1<<0)  /* Window EXPected Space period Used bit 0 mask. */
#define STYLUSCOM_WEXPSU0_bp  0  /* Window EXPected Space period Used bit 0 position. */
#define STYLUSCOM_WEXPSU1_bm  (1<<1)  /* Window EXPected Space period Used bit 1 mask. */
#define STYLUSCOM_WEXPSU1_bp  1  /* Window EXPected Space period Used bit 1 position. */
#define STYLUSCOM_WEXPSU2_bm  (1<<2)  /* Window EXPected Space period Used bit 2 mask. */
#define STYLUSCOM_WEXPSU2_bp  2  /* Window EXPected Space period Used bit 2 position. */
#define STYLUSCOM_WEXPSU3_bm  (1<<3)  /* Window EXPected Space period Used bit 3 mask. */
#define STYLUSCOM_WEXPSU3_bp  3  /* Window EXPected Space period Used bit 3 position. */
#define STYLUSCOM_WEXPSU4_bm  (1<<4)  /* Window EXPected Space period Used bit 4 mask. */
#define STYLUSCOM_WEXPSU4_bp  4  /* Window EXPected Space period Used bit 4 position. */
#define STYLUSCOM_WEXPSU5_bm  (1<<5)  /* Window EXPected Space period Used bit 5 mask. */
#define STYLUSCOM_WEXPSU5_bp  5  /* Window EXPected Space period Used bit 5 position. */
#define STYLUSCOM_WEXPSU6_bm  (1<<6)  /* Window EXPected Space period Used bit 6 mask. */
#define STYLUSCOM_WEXPSU6_bp  6  /* Window EXPected Space period Used bit 6 position. */
#define STYLUSCOM_WEXPSU7_bm  (1<<7)  /* Window EXPected Space period Used bit 7 mask. */
#define STYLUSCOM_WEXPSU7_bp  7  /* Window EXPected Space period Used bit 7 position. */

/* STYLUSCOM.RTWEXPSUH  bit masks and bit positions */
/* STYLUSCOM_WEXPSU  is already defined. */
/* STYLUSCOM_SORT  is already defined. */

