gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts200reva.h
/* STYLUSCOM.RTCNT0H  bit masks and bit positions */
/* STYLUSCOM_RTCNT  is already defined. */

/* STYLUSCOM.RTCNT1L  bit masks and bit positions */
/* STYLUSCOM_RTCNT  is already defined. */

/* STYLUSCOM.RTCNT1H  bit masks and bit positions */
/* STYLUSCOM_RTCNT  is already defined. */

/* STYLUSCOM.RT0CL  bit masks and bit positions */
#define STYLUSCOM_RTC_gm  0xFF  /* Receive Timer x Capture Register group mask. */
#define STYLUSCOM_RTC_gp  0  /* Receive Timer x Capture Register group position. */
#define STYLUSCOM_RTC0_bm  (1<<0)  /* Receive Timer x Capture Register bit 0 mask. */
#define STYLUSCOM_RTC0_bp  0  /* Receive Timer x Capture Register bit 0 position. */
#define STYLUSCOM_RTC1_bm  (1<<1)  /* Receive Timer x Capture Register bit 1 mask. */
#define STYLUSCOM_RTC1_bp  1  /* Receive Timer x Capture Register bit 1 position. */
#define STYLUSCOM_RTC2_bm  (1<<2)  /* Receive Timer x Capture Register bit 2 mask. */
#define STYLUSCOM_RTC2_bp  2  /* Receive Timer x Capture Register bit 2 position. */
#define STYLUSCOM_RTC3_bm  (1<<3)  /* Receive Timer x Capture Register bit 3 mask. */
#define STYLUSCOM_RTC3_bp  3  /* Receive Timer x Capture Register bit 3 position. */
#define STYLUSCOM_RTC4_bm  (1<<4)  /* Receive Timer x Capture Register bit 4 mask. */
#define STYLUSCOM_RTC4_bp  4  /* Receive Timer x Capture Register bit 4 position. */
#define STYLUSCOM_RTC5_bm  (1<<5)  /* Receive Timer x Capture Register bit 5 mask. */
#define STYLUSCOM_RTC5_bp  5  /* Receive Timer x Capture Register bit 5 position. */
#define STYLUSCOM_RTC6_bm  (1<<6)  /* Receive Timer x Capture Register bit 6 mask. */
#define STYLUSCOM_RTC6_bp  6  /* Receive Timer x Capture Register bit 6 position. */
#define STYLUSCOM_RTC7_bm  (1<<7)  /* Receive Timer x Capture Register bit 7 mask. */
#define STYLUSCOM_RTC7_bp  7  /* Receive Timer x Capture Register bit 7 position. */

/* STYLUSCOM.RT0CH  bit masks and bit positions */
/* STYLUSCOM_RTC  is already defined. */
#define STYLUSCOM_MTEMP_bm  0x02  /* MEDIAN TEMPORARY IN REGISTER bit mask. */
#define STYLUSCOM_MTEMP_bp  1  /* MEDIAN TEMPORARY IN REGISTER bit position. */

/* STYLUSCOM.RT1CL  bit masks and bit positions */
/* STYLUSCOM_RTC  is already defined. */

/* STYLUSCOM.RT1CH  bit masks and bit positions */
/* STYLUSCOM_RTC  is already defined. */
/* STYLUSCOM_MTEMP  is already defined. */

/* STYLUSCOM.TEMP  bit masks and bit positions */
#define STYLUSCOM_TEMP_gm  0xFF  /* Temporary register group mask. */
#define STYLUSCOM_TEMP_gp  0  /* Temporary register group position. */
#define STYLUSCOM_TEMP0_bm  (1<<0)  /* Temporary register bit 0 mask. */
#define STYLUSCOM_TEMP0_bp  0  /* Temporary register bit 0 position. */
#define STYLUSCOM_TEMP1_bm  (1<<1)  /* Temporary register bit 1 mask. */
#define STYLUSCOM_TEMP1_bp  1  /* Temporary register bit 1 position. */
#define STYLUSCOM_TEMP2_bm  (1<<2)  /* Temporary register bit 2 mask. */
#define STYLUSCOM_TEMP2_bp  2  /* Temporary register bit 2 position. */
#define STYLUSCOM_TEMP3_bm  (1<<3)  /* Temporary register bit 3 mask. */
#define STYLUSCOM_TEMP3_bp  3  /* Temporary register bit 3 position. */
#define STYLUSCOM_TEMP4_bm  (1<<4)  /* Temporary register bit 4 mask. */
#define STYLUSCOM_TEMP4_bp  4  /* Temporary register bit 4 position. */
#define STYLUSCOM_TEMP5_bm  (1<<5)  /* Temporary register bit 5 mask. */
#define STYLUSCOM_TEMP5_bp  5  /* Temporary register bit 5 position. */
#define STYLUSCOM_TEMP6_bm  (1<<6)  /* Temporary register bit 6 mask. */
#define STYLUSCOM_TEMP6_bp  6  /* Temporary register bit 6 position. */
#define STYLUSCOM_TEMP7_bm  (1<<7)  /* Temporary register bit 7 mask. */
#define STYLUSCOM_TEMP7_bp  7  /* Temporary register bit 7 position. */

/* STYLUSCOM.TDR0  bit masks and bit positions */
#define STYLUSCOM_TD_gm  0xFF  /* Transmit Data byte 0 group mask. */
#define STYLUSCOM_TD_gp  0  /* Transmit Data byte 0 group position. */
#define STYLUSCOM_TD0_bm  (1<<0)  /* Transmit Data byte 0 bit 0 mask. */
#define STYLUSCOM_TD0_bp  0  /* Transmit Data byte 0 bit 0 position. */
#define STYLUSCOM_TD1_bm  (1<<1)  /* Transmit Data byte 0 bit 1 mask. */
#define STYLUSCOM_TD1_bp  1  /* Transmit Data byte 0 bit 1 position. */
#define STYLUSCOM_TD2_bm  (1<<2)  /* Transmit Data byte 0 bit 2 mask. */
#define STYLUSCOM_TD2_bp  2  /* Transmit Data byte 0 bit 2 position. */
#define STYLUSCOM_TD3_bm  (1<<3)  /* Transmit Data byte 0 bit 3 mask. */
#define STYLUSCOM_TD3_bp  3  /* Transmit Data byte 0 bit 3 position. */
#define STYLUSCOM_TD4_bm  (1<<4)  /* Transmit Data byte 0 bit 4 mask. */
#define STYLUSCOM_TD4_bp  4  /* Transmit Data byte 0 bit 4 position. */
#define STYLUSCOM_TD5_bm  (1<<5)  /* Transmit Data byte 0 bit 5 mask. */
#define STYLUSCOM_TD5_bp  5  /* Transmit Data byte 0 bit 5 position. */
#define STYLUSCOM_TD6_bm  (1<<6)  /* Transmit Data byte 0 bit 6 mask. */
#define STYLUSCOM_TD6_bp  6  /* Transmit Data byte 0 bit 6 position. */
#define STYLUSCOM_TD7_bm  (1<<7)  /* Transmit Data byte 0 bit 7 mask. */
#define STYLUSCOM_TD7_bp  7  /* Transmit Data byte 0 bit 7 position. */

/* STYLUSCOM.TDR1  bit masks and bit positions */
/* STYLUSCOM_TD  is already defined. */

/* STYLUSCOM.TDR2  bit masks and bit positions */
/* STYLUSCOM_TD  is already defined. */

/* STYLUSCOM.TDR3  bit masks and bit positions */
/* STYLUSCOM_TD  is already defined. */

/* STYLUSCOM.TDR4  bit masks and bit positions */
/* STYLUSCOM_TD  is already defined. */

/* STYLUSCOM.TDR5  bit masks and bit positions */
/* STYLUSCOM_TD  is already defined. */

/* STYLUSCOM.TDR6  bit masks and bit positions */
/* STYLUSCOM_TD  is already defined. */

/* STYLUSCOM.TDR7  bit masks and bit positions */
/* STYLUSCOM_TD  is already defined. */

/* STYLUSCOM.INTCTRLA  bit masks and bit positions */
#define STYLUSCOM_ETINTLVL_gm  0x03  /* End of pulse Train Interrupt Level group mask. */
#define STYLUSCOM_ETINTLVL_gp  0  /* End of pulse Train Interrupt Level group position. */
#define STYLUSCOM_ETINTLVL0_bm  (1<<0)  /* End of pulse Train Interrupt Level bit 0 mask. */
#define STYLUSCOM_ETINTLVL0_bp  0  /* End of pulse Train Interrupt Level bit 0 position. */
#define STYLUSCOM_ETINTLVL1_bm  (1<<1)  /* End of pulse Train Interrupt Level bit 1 mask. */
#define STYLUSCOM_ETINTLVL1_bp  1  /* End of pulse Train Interrupt Level bit 1 position. */
#define STYLUSCOM_ASINTLVL_gm  0x0C  /* Abort Status Interrupt Level group mask. */
#define STYLUSCOM_ASINTLVL_gp  2  /* Abort Status Interrupt Level group position. */
#define STYLUSCOM_ASINTLVL0_bm  (1<<2)  /* Abort Status Interrupt Level bit 0 mask. */
#define STYLUSCOM_ASINTLVL0_bp  2  /* Abort Status Interrupt Level bit 0 position. */
#define STYLUSCOM_ASINTLVL1_bm  (1<<3)  /* Abort Status Interrupt Level bit 1 mask. */
#define STYLUSCOM_ASINTLVL1_bp  3  /* Abort Status Interrupt Level bit 1 position. */
#define STYLUSCOM_EHINTLVL_gm  0x30  /* End of Header Interrupt Level group mask. */
#define STYLUSCOM_EHINTLVL_gp  4  /* End of Header Interrupt Level group position. */
#define STYLUSCOM_EHINTLVL0_bm  (1<<4)  /* End of Header Interrupt Level bit 0 mask. */
#define STYLUSCOM_EHINTLVL0_bp  4  /* End of Header Interrupt Level bit 0 position. */
#define STYLUSCOM_EHINTLVL1_bm  (1<<5)  /* End of Header Interrupt Level bit 1 mask. */
#define STYLUSCOM_EHINTLVL1_bp  5  /* End of Header Interrupt Level bit 1 position. */
#define STYLUSCOM_SHINTLVL_gm  0xC0  /* Start of Header Interrupt Level group mask. */
#define STYLUSCOM_SHINTLVL_gp  6  /* Start of Header Interrupt Level group position. */
#define STYLUSCOM_SHINTLVL0_bm  (1<<6)  /* Start of Header Interrupt Level bit 0 mask. */
#define STYLUSCOM_SHINTLVL0_bp  6  /* Start of Header Interrupt Level bit 0 position. */
#define STYLUSCOM_SHINTLVL1_bm  (1<<7)  /* Start of Header Interrupt Level bit 1 mask. */
#define STYLUSCOM_SHINTLVL1_bp  7  /* Start of Header Interrupt Level bit 1 position. */

/* STYLUSCOM.INTCTRLB  bit masks and bit positions */
#define STYLUSCOM_DBINTLVL_gm  0x03  /* Debug Interrupt Level group mask. */
#define STYLUSCOM_DBINTLVL_gp  0  /* Debug Interrupt Level group position. */
#define STYLUSCOM_DBINTLVL0_bm  (1<<0)  /* Debug Interrupt Level bit 0 mask. */
#define STYLUSCOM_DBINTLVL0_bp  0  /* Debug Interrupt Level bit 0 position. */
#define STYLUSCOM_DBINTLVL1_bm  (1<<1)  /* Debug Interrupt Level bit 1 mask. */
#define STYLUSCOM_DBINTLVL1_bp  1  /* Debug Interrupt Level bit 1 position. */

