gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts200reva.h
/* TIM8_16.STATUS  bit masks and bit positions */
#define TIM8_16_OVF_bm  0x01  /* Overflow Interrupt Flag bit mask. */
#define TIM8_16_OVF_bp  0  /* Overflow Interrupt Flag bit position. */
#define TIM8_16_OCFA_bm  0x02  /* Output Compare Match A Interrupt Flag bit mask. */
#define TIM8_16_OCFA_bp  1  /* Output Compare Match A Interrupt Flag bit position. */
#define TIM8_16_OCFB_bm  0x04  /* Output Compare Match B Interrupt Flag bit mask. */
#define TIM8_16_OCFB_bp  2  /* Output Compare Match B Interrupt Flag bit position. */
#define TIM8_16_ICF_bm  0x08  /* Input Capture Interrupt Flag bit mask. */
#define TIM8_16_ICF_bp  3  /* Input Capture Interrupt Flag bit position. */

/* TIM8_16.TEMP  bit masks and bit positions */
#define TIM8_16_TEMP_gm  0xFF  /* Temporary High Byte Value group mask. */
#define TIM8_16_TEMP_gp  0  /* Temporary High Byte Value group position. */
#define TIM8_16_TEMP0_bm  (1<<0)  /* Temporary High Byte Value bit 0 mask. */
#define TIM8_16_TEMP0_bp  0  /* Temporary High Byte Value bit 0 position. */
#define TIM8_16_TEMP1_bm  (1<<1)  /* Temporary High Byte Value bit 1 mask. */
#define TIM8_16_TEMP1_bp  1  /* Temporary High Byte Value bit 1 position. */
#define TIM8_16_TEMP2_bm  (1<<2)  /* Temporary High Byte Value bit 2 mask. */
#define TIM8_16_TEMP2_bp  2  /* Temporary High Byte Value bit 2 position. */
#define TIM8_16_TEMP3_bm  (1<<3)  /* Temporary High Byte Value bit 3 mask. */
#define TIM8_16_TEMP3_bp  3  /* Temporary High Byte Value bit 3 position. */
#define TIM8_16_TEMP4_bm  (1<<4)  /* Temporary High Byte Value bit 4 mask. */
#define TIM8_16_TEMP4_bp  4  /* Temporary High Byte Value bit 4 position. */
#define TIM8_16_TEMP5_bm  (1<<5)  /* Temporary High Byte Value bit 5 mask. */
#define TIM8_16_TEMP5_bp  5  /* Temporary High Byte Value bit 5 position. */
#define TIM8_16_TEMP6_bm  (1<<6)  /* Temporary High Byte Value bit 6 mask. */
#define TIM8_16_TEMP6_bp  6  /* Temporary High Byte Value bit 6 position. */
#define TIM8_16_TEMP7_bm  (1<<7)  /* Temporary High Byte Value bit 7 mask. */
#define TIM8_16_TEMP7_bp  7  /* Temporary High Byte Value bit 7 position. */

/* TIM8_16.COUNTL  bit masks and bit positions */
#define TIM8_16_COUNT_gm  0xFF  /* Counter Value Low Byte group mask. */
#define TIM8_16_COUNT_gp  0  /* Counter Value Low Byte group position. */
#define TIM8_16_COUNT0_bm  (1<<0)  /* Counter Value Low Byte bit 0 mask. */
#define TIM8_16_COUNT0_bp  0  /* Counter Value Low Byte bit 0 position. */
#define TIM8_16_COUNT1_bm  (1<<1)  /* Counter Value Low Byte bit 1 mask. */
#define TIM8_16_COUNT1_bp  1  /* Counter Value Low Byte bit 1 position. */
#define TIM8_16_COUNT2_bm  (1<<2)  /* Counter Value Low Byte bit 2 mask. */
#define TIM8_16_COUNT2_bp  2  /* Counter Value Low Byte bit 2 position. */
#define TIM8_16_COUNT3_bm  (1<<3)  /* Counter Value Low Byte bit 3 mask. */
#define TIM8_16_COUNT3_bp  3  /* Counter Value Low Byte bit 3 position. */
#define TIM8_16_COUNT4_bm  (1<<4)  /* Counter Value Low Byte bit 4 mask. */
#define TIM8_16_COUNT4_bp  4  /* Counter Value Low Byte bit 4 position. */
#define TIM8_16_COUNT5_bm  (1<<5)  /* Counter Value Low Byte bit 5 mask. */
#define TIM8_16_COUNT5_bp  5  /* Counter Value Low Byte bit 5 position. */
#define TIM8_16_COUNT6_bm  (1<<6)  /* Counter Value Low Byte bit 6 mask. */
#define TIM8_16_COUNT6_bp  6  /* Counter Value Low Byte bit 6 position. */
#define TIM8_16_COUNT7_bm  (1<<7)  /* Counter Value Low Byte bit 7 mask. */
#define TIM8_16_COUNT7_bp  7  /* Counter Value Low Byte bit 7 position. */

/* TIM8_16.COUNTH  bit masks and bit positions */
/* TIM8_16_COUNT  is already defined. */

/* TIM8_16.OCRA  bit masks and bit positions */
#define TIM8_16_OCRA_gm  0xFF  /* Output Compare Value A group mask. */
#define TIM8_16_OCRA_gp  0  /* Output Compare Value A group position. */
#define TIM8_16_OCRA0_bm  (1<<0)  /* Output Compare Value A bit 0 mask. */
#define TIM8_16_OCRA0_bp  0  /* Output Compare Value A bit 0 position. */
#define TIM8_16_OCRA1_bm  (1<<1)  /* Output Compare Value A bit 1 mask. */
#define TIM8_16_OCRA1_bp  1  /* Output Compare Value A bit 1 position. */
#define TIM8_16_OCRA2_bm  (1<<2)  /* Output Compare Value A bit 2 mask. */
#define TIM8_16_OCRA2_bp  2  /* Output Compare Value A bit 2 position. */
#define TIM8_16_OCRA3_bm  (1<<3)  /* Output Compare Value A bit 3 mask. */
#define TIM8_16_OCRA3_bp  3  /* Output Compare Value A bit 3 position. */
#define TIM8_16_OCRA4_bm  (1<<4)  /* Output Compare Value A bit 4 mask. */
#define TIM8_16_OCRA4_bp  4  /* Output Compare Value A bit 4 position. */
#define TIM8_16_OCRA5_bm  (1<<5)  /* Output Compare Value A bit 5 mask. */
#define TIM8_16_OCRA5_bp  5  /* Output Compare Value A bit 5 position. */
#define TIM8_16_OCRA6_bm  (1<<6)  /* Output Compare Value A bit 6 mask. */
#define TIM8_16_OCRA6_bp  6  /* Output Compare Value A bit 6 position. */
#define TIM8_16_OCRA7_bm  (1<<7)  /* Output Compare Value A bit 7 mask. */
#define TIM8_16_OCRA7_bp  7  /* Output Compare Value A bit 7 position. */

/* TIM8_16.OCRB  bit masks and bit positions */
#define TIM8_16_OCRB_gm  0xFF  /* Output Compare Value B group mask. */
#define TIM8_16_OCRB_gp  0  /* Output Compare Value B group position. */
#define TIM8_16_OCRB0_bm  (1<<0)  /* Output Compare Value B bit 0 mask. */
#define TIM8_16_OCRB0_bp  0  /* Output Compare Value B bit 0 position. */
#define TIM8_16_OCRB1_bm  (1<<1)  /* Output Compare Value B bit 1 mask. */
#define TIM8_16_OCRB1_bp  1  /* Output Compare Value B bit 1 position. */
#define TIM8_16_OCRB2_bm  (1<<2)  /* Output Compare Value B bit 2 mask. */
#define TIM8_16_OCRB2_bp  2  /* Output Compare Value B bit 2 position. */
#define TIM8_16_OCRB3_bm  (1<<3)  /* Output Compare Value B bit 3 mask. */
#define TIM8_16_OCRB3_bp  3  /* Output Compare Value B bit 3 position. */
#define TIM8_16_OCRB4_bm  (1<<4)  /* Output Compare Value B bit 4 mask. */
#define TIM8_16_OCRB4_bp  4  /* Output Compare Value B bit 4 position. */
#define TIM8_16_OCRB5_bm  (1<<5)  /* Output Compare Value B bit 5 mask. */
#define TIM8_16_OCRB5_bp  5  /* Output Compare Value B bit 5 position. */
#define TIM8_16_OCRB6_bm  (1<<6)  /* Output Compare Value B bit 6 mask. */
#define TIM8_16_OCRB6_bp  6  /* Output Compare Value B bit 6 position. */
#define TIM8_16_OCRB7_bm  (1<<7)  /* Output Compare Value B bit 7 mask. */
#define TIM8_16_OCRB7_bp  7  /* Output Compare Value B bit 7 position. */

/* TIMPRESC - Timer Prescaler */
/* TIMPRESC.PRESC  bit masks and bit positions */
#define TIMPRESC_PSRSYNC_bm  0x01  /* Prescaler Reset bit mask. */
#define TIMPRESC_PSRSYNC_bp  0  /* Prescaler Reset bit position. */
#define TIMPRESC_TSM_bm  0x80  /* Timer Synchronization mode Register bit mask. */
#define TIMPRESC_TSM_bp  7  /* Timer Synchronization mode Register bit position. */

/* TSTACC - Test Access Control */
/* TSTACC.SIGNATURE  bit masks and bit positions */
#define TSTACC_SIGNATURE_gm  0xFF  /* Signature Value group mask. */
#define TSTACC_SIGNATURE_gp  0  /* Signature Value group position. */
#define TSTACC_SIGNATURE0_bm  (1<<0)  /* Signature Value bit 0 mask. */
#define TSTACC_SIGNATURE0_bp  0  /* Signature Value bit 0 position. */
#define TSTACC_SIGNATURE1_bm  (1<<1)  /* Signature Value bit 1 mask. */
#define TSTACC_SIGNATURE1_bp  1  /* Signature Value bit 1 position. */
#define TSTACC_SIGNATURE2_bm  (1<<2)  /* Signature Value bit 2 mask. */
#define TSTACC_SIGNATURE2_bp  2  /* Signature Value bit 2 position. */
#define TSTACC_SIGNATURE3_bm  (1<<3)  /* Signature Value bit 3 mask. */
#define TSTACC_SIGNATURE3_bp  3  /* Signature Value bit 3 position. */
#define TSTACC_SIGNATURE4_bm  (1<<4)  /* Signature Value bit 4 mask. */
#define TSTACC_SIGNATURE4_bp  4  /* Signature Value bit 4 position. */
#define TSTACC_SIGNATURE5_bm  (1<<5)  /* Signature Value bit 5 mask. */
#define TSTACC_SIGNATURE5_bp  5  /* Signature Value bit 5 position. */
#define TSTACC_SIGNATURE6_bm  (1<<6)  /* Signature Value bit 6 mask. */
#define TSTACC_SIGNATURE6_bp  6  /* Signature Value bit 6 position. */
#define TSTACC_SIGNATURE7_bm  (1<<7)  /* Signature Value bit 7 mask. */
#define TSTACC_SIGNATURE7_bp  7  /* Signature Value bit 7 position. */

/* TSTACC.STATUS  bit masks and bit positions */
#define TSTACC_CTM_bm  0x01  /* Combined Test Mode bit mask. */
#define TSTACC_CTM_bp  0  /* Combined Test Mode bit position. */

/* TSTCTRL - Test Control */
/* TSTCTRL.CTRL0  bit masks and bit positions */
#define TSTCTRL_CTRL_gm  0xFF  /* Control Register group mask. */
#define TSTCTRL_CTRL_gp  0  /* Control Register group position. */
#define TSTCTRL_CTRL0_bm  (1<<0)  /* Control Register bit 0 mask. */
#define TSTCTRL_CTRL0_bp  0  /* Control Register bit 0 position. */
#define TSTCTRL_CTRL1_bm  (1<<1)  /* Control Register bit 1 mask. */
#define TSTCTRL_CTRL1_bp  1  /* Control Register bit 1 position. */
#define TSTCTRL_CTRL2_bm  (1<<2)  /* Control Register bit 2 mask. */
#define TSTCTRL_CTRL2_bp  2  /* Control Register bit 2 position. */
#define TSTCTRL_CTRL3_bm  (1<<3)  /* Control Register bit 3 mask. */
#define TSTCTRL_CTRL3_bp  3  /* Control Register bit 3 position. */
#define TSTCTRL_CTRL4_bm  (1<<4)  /* Control Register bit 4 mask. */
#define TSTCTRL_CTRL4_bp  4  /* Control Register bit 4 position. */
#define TSTCTRL_CTRL5_bm  (1<<5)  /* Control Register bit 5 mask. */
#define TSTCTRL_CTRL5_bp  5  /* Control Register bit 5 position. */
#define TSTCTRL_CTRL6_bm  (1<<6)  /* Control Register bit 6 mask. */
#define TSTCTRL_CTRL6_bp  6  /* Control Register bit 6 position. */
#define TSTCTRL_CTRL7_bm  (1<<7)  /* Control Register bit 7 mask. */
#define TSTCTRL_CTRL7_bp  7  /* Control Register bit 7 position. */

/* TSTCTRL.CTRL1  bit masks and bit positions */
/* TSTCTRL_CTRL  is already defined. */

/* TSTCTRL.CTRL2  bit masks and bit positions */
/* TSTCTRL_CTRL  is already defined. */

/* TSTCTRL.CTRL3  bit masks and bit positions */
/* TSTCTRL_CTRL  is already defined. */

