gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts200reva.h
/* TWI - Two-Wire Interface */
/* TWI.CTRL  bit masks and bit positions */
#define TWI_EDIEN_bm  0x01  /* External Driver Interface Enable bit mask. */
#define TWI_EDIEN_bp  0  /* External Driver Interface Enable bit position. */
#define TWI_SDAHOLD_gm  0x06  /* SDA Hold Time Enable group mask. */
#define TWI_SDAHOLD_gp  1  /* SDA Hold Time Enable group position. */
#define TWI_SDAHOLD0_bm  (1<<1)  /* SDA Hold Time Enable bit 0 mask. */
#define TWI_SDAHOLD0_bp  1  /* SDA Hold Time Enable bit 0 position. */
#define TWI_SDAHOLD1_bm  (1<<2)  /* SDA Hold Time Enable bit 1 mask. */
#define TWI_SDAHOLD1_bp  2  /* SDA Hold Time Enable bit 1 position. */

/* TWI_MASTER.CTRLA  bit masks and bit positions */
#define TWI_MASTER_ENABLE_bm  0x08  /* Enable TWI Master bit mask. */
#define TWI_MASTER_ENABLE_bp  3  /* Enable TWI Master bit position. */
#define TWI_MASTER_WIEN_bm  0x10  /* Write Interrupt Enable bit mask. */
#define TWI_MASTER_WIEN_bp  4  /* Write Interrupt Enable bit position. */
#define TWI_MASTER_RIEN_bm  0x20  /* Read Interrupt Enable bit mask. */
#define TWI_MASTER_RIEN_bp  5  /* Read Interrupt Enable bit position. */
#define TWI_MASTER_INTLVL_gm  0xC0  /* Interrupt Level group mask. */
#define TWI_MASTER_INTLVL_gp  6  /* Interrupt Level group position. */
#define TWI_MASTER_INTLVL0_bm  (1<<6)  /* Interrupt Level bit 0 mask. */
#define TWI_MASTER_INTLVL0_bp  6  /* Interrupt Level bit 0 position. */
#define TWI_MASTER_INTLVL1_bm  (1<<7)  /* Interrupt Level bit 1 mask. */
#define TWI_MASTER_INTLVL1_bp  7  /* Interrupt Level bit 1 position. */

/* TWI_MASTER.CTRLB  bit masks and bit positions */
#define TWI_MASTER_SMEN_bm  0x01  /* Smart Mode Enable bit mask. */
#define TWI_MASTER_SMEN_bp  0  /* Smart Mode Enable bit position. */
#define TWI_MASTER_QCEN_bm  0x02  /* Quick Command Enable bit mask. */
#define TWI_MASTER_QCEN_bp  1  /* Quick Command Enable bit position. */
#define TWI_MASTER_TIMEOUT_gm  0x0C  /* Inactive Bus Timeout group mask. */
#define TWI_MASTER_TIMEOUT_gp  2  /* Inactive Bus Timeout group position. */
#define TWI_MASTER_TIMEOUT0_bm  (1<<2)  /* Inactive Bus Timeout bit 0 mask. */
#define TWI_MASTER_TIMEOUT0_bp  2  /* Inactive Bus Timeout bit 0 position. */
#define TWI_MASTER_TIMEOUT1_bm  (1<<3)  /* Inactive Bus Timeout bit 1 mask. */
#define TWI_MASTER_TIMEOUT1_bp  3  /* Inactive Bus Timeout bit 1 position. */

/* TWI_MASTER.CTRLC  bit masks and bit positions */
#define TWI_MASTER_CMD_gm  0x03  /* Command group mask. */
#define TWI_MASTER_CMD_gp  0  /* Command group position. */
#define TWI_MASTER_CMD0_bm  (1<<0)  /* Command bit 0 mask. */
#define TWI_MASTER_CMD0_bp  0  /* Command bit 0 position. */
#define TWI_MASTER_CMD1_bm  (1<<1)  /* Command bit 1 mask. */
#define TWI_MASTER_CMD1_bp  1  /* Command bit 1 position. */
#define TWI_MASTER_ACKACT_bm  0x04  /* Acknowledge Action bit mask. */
#define TWI_MASTER_ACKACT_bp  2  /* Acknowledge Action bit position. */

/* TWI_MASTER.STATUS  bit masks and bit positions */
#define TWI_MASTER_BUSSTATE_gm  0x03  /* Bus State group mask. */
#define TWI_MASTER_BUSSTATE_gp  0  /* Bus State group position. */
#define TWI_MASTER_BUSSTATE0_bm  (1<<0)  /* Bus State bit 0 mask. */
#define TWI_MASTER_BUSSTATE0_bp  0  /* Bus State bit 0 position. */
#define TWI_MASTER_BUSSTATE1_bm  (1<<1)  /* Bus State bit 1 mask. */
#define TWI_MASTER_BUSSTATE1_bp  1  /* Bus State bit 1 position. */
#define TWI_MASTER_BUSERR_bm  0x04  /* Bus Error bit mask. */
#define TWI_MASTER_BUSERR_bp  2  /* Bus Error bit position. */
#define TWI_MASTER_ARBLOST_bm  0x08  /* Arbitration Lost bit mask. */
#define TWI_MASTER_ARBLOST_bp  3  /* Arbitration Lost bit position. */
#define TWI_MASTER_RXACK_bm  0x10  /* Received Acknowledge bit mask. */
#define TWI_MASTER_RXACK_bp  4  /* Received Acknowledge bit position. */
#define TWI_MASTER_CLKHOLD_bm  0x20  /* Clock Hold bit mask. */
#define TWI_MASTER_CLKHOLD_bp  5  /* Clock Hold bit position. */
#define TWI_MASTER_WIF_bm  0x40  /* Write Interrupt Flag bit mask. */
#define TWI_MASTER_WIF_bp  6  /* Write Interrupt Flag bit position. */
#define TWI_MASTER_RIF_bm  0x80  /* Read Interrupt Flag bit mask. */
#define TWI_MASTER_RIF_bp  7  /* Read Interrupt Flag bit position. */

/* TWI_MASTER.BAUD  bit masks and bit positions */
#define TWI_MASTER_BAUD_gm  0xFF  /* Baud Rade Register group mask. */
#define TWI_MASTER_BAUD_gp  0  /* Baud Rade Register group position. */
#define TWI_MASTER_BAUD0_bm  (1<<0)  /* Baud Rade Register bit 0 mask. */
#define TWI_MASTER_BAUD0_bp  0  /* Baud Rade Register bit 0 position. */
#define TWI_MASTER_BAUD1_bm  (1<<1)  /* Baud Rade Register bit 1 mask. */
#define TWI_MASTER_BAUD1_bp  1  /* Baud Rade Register bit 1 position. */
#define TWI_MASTER_BAUD2_bm  (1<<2)  /* Baud Rade Register bit 2 mask. */
#define TWI_MASTER_BAUD2_bp  2  /* Baud Rade Register bit 2 position. */
#define TWI_MASTER_BAUD3_bm  (1<<3)  /* Baud Rade Register bit 3 mask. */
#define TWI_MASTER_BAUD3_bp  3  /* Baud Rade Register bit 3 position. */
#define TWI_MASTER_BAUD4_bm  (1<<4)  /* Baud Rade Register bit 4 mask. */
#define TWI_MASTER_BAUD4_bp  4  /* Baud Rade Register bit 4 position. */
#define TWI_MASTER_BAUD5_bm  (1<<5)  /* Baud Rade Register bit 5 mask. */
#define TWI_MASTER_BAUD5_bp  5  /* Baud Rade Register bit 5 position. */
#define TWI_MASTER_BAUD6_bm  (1<<6)  /* Baud Rade Register bit 6 mask. */
#define TWI_MASTER_BAUD6_bp  6  /* Baud Rade Register bit 6 position. */
#define TWI_MASTER_BAUD7_bm  (1<<7)  /* Baud Rade Register bit 7 mask. */
#define TWI_MASTER_BAUD7_bp  7  /* Baud Rade Register bit 7 position. */

/* TWI_MASTER.ADDR  bit masks and bit positions */
#define TWI_MASTER_ADDR_gm  0xFF  /* Address Register group mask. */
#define TWI_MASTER_ADDR_gp  0  /* Address Register group position. */
#define TWI_MASTER_ADDR0_bm  (1<<0)  /* Address Register bit 0 mask. */
#define TWI_MASTER_ADDR0_bp  0  /* Address Register bit 0 position. */
#define TWI_MASTER_ADDR1_bm  (1<<1)  /* Address Register bit 1 mask. */
#define TWI_MASTER_ADDR1_bp  1  /* Address Register bit 1 position. */
#define TWI_MASTER_ADDR2_bm  (1<<2)  /* Address Register bit 2 mask. */
#define TWI_MASTER_ADDR2_bp  2  /* Address Register bit 2 position. */
#define TWI_MASTER_ADDR3_bm  (1<<3)  /* Address Register bit 3 mask. */
#define TWI_MASTER_ADDR3_bp  3  /* Address Register bit 3 position. */
#define TWI_MASTER_ADDR4_bm  (1<<4)  /* Address Register bit 4 mask. */
#define TWI_MASTER_ADDR4_bp  4  /* Address Register bit 4 position. */
#define TWI_MASTER_ADDR5_bm  (1<<5)  /* Address Register bit 5 mask. */
#define TWI_MASTER_ADDR5_bp  5  /* Address Register bit 5 position. */
#define TWI_MASTER_ADDR6_bm  (1<<6)  /* Address Register bit 6 mask. */
#define TWI_MASTER_ADDR6_bp  6  /* Address Register bit 6 position. */
#define TWI_MASTER_ADDR7_bm  (1<<7)  /* Address Register bit 7 mask. */
#define TWI_MASTER_ADDR7_bp  7  /* Address Register bit 7 position. */

